{
  "title": "Проверьте себя: совершаете ли вы эти ошибки в английском",
  "views": "1K",
  "link": "https://habr.com/ru/companies/yandex_praktikum/articles/933344/",
  "text": {
    "article_content": [
      "Привет! Меня зовут Маша Фадеева, я методист и преподавательанглийского в Практикуме. Ошибки — штука одновременно объективная и субъективная: есть чёткие правила, есть стилистический выбор, а есть то, что раньше было недопустимо, а теперь превратилось в норму и волнует разве что души преподавателей старой закалки и людей с активной грамматической позицией.",
      "—Сейчас подпишем дóговор, и можно отвлечься на кофе. Будешь? Я закажу.",
      "— С удовольствием. Возьми мне чёрное. И йогýрт.",
      "В английском это работает по той же схеме. Мы неделями учимPresent Simpleс его третьим-лицом-единственным-числом, чтобы потом включитьBon Joviи ломать голову над тем, почему у нихShe don’t know meвместоShe doesn’t —и это тот самый стилистический выбор, хотя, казалось бы, очевиднее ошибку найти сложно.",
      "В этой статье речь пойдёт преимущественно о тех моментах, которые наталкивают не на мысли о стилистике, а на желание человека поправить. Я поделюсь своими наблюдениями и расскажу об ошибках, которые встречаются даже у продвинутых студентов, и расскажу, как с ними можно работать.",
      "Фразовые глаголы — больное место и общая проблема всех и сразу. Однако люди «постарше» пользуются ими активнее, поэтому возникает ощущение, что ошибка, о которой пойдёт речь, характерна для студентов с уровнем B1–B2.",
      "Студенты этих уровней уже научены не воспринимать фразовый глагол по частям и понимают, что он — единое целое, и делить это целое на глагол и предлог ни в коем случае нельзя, потому что есть опасность перевести дословно и потерять смысл.",
      "Иногда это приводит к тому, что все манипуляции, которые мы должны производить с глаголом, чтобы показать время, тип действия или форму, достаются предлогу — или всем сразу. И получается нечто загадочное.",
      "Неверно:",
      "Helook upsmovie reviews before watching.Он ищет отзывы, перед тем как смотреть фильмы.",
      "She alwayschecks insbefore noon, so she has to pay extra.Она всегда регистрируется до полудня, поэтому ей приходится платить больше.",
      "Верно:",
      "Helooks upmovie reviews before watching.She alwayschecks inbefore noon, so she has to pay extra.",
      "Важный нюанс:",
      "The app runs multiplelookupsfor accuracy.Приложение выполняет несколько проверок для точности.",
      "The hotel offers earlycheck-insfor VIP guests.Отель предлагает услугу раннего заезда для VIP-гостей.",
      "Чаще всего такая ситуация случается с фразовыми глаголами, у которых есть существительные-двойники (например,lookupsиcheck-ins), поэтому мозгу и всем задействованным мышцам уже привычно и не странно добавить в конец-s. Давайте приведу ещё один пример такого двойника:",
      "They’vedropped outof college.Они отчислились из колледжа. Здесьdrop out —фразовый глагол «бросать», «вылетать».",
      "They’re collegedropouts. Они «отчисленцы». Здесьdropout— существительное со значением «человек, бросивший учёбу».",
      "Бывают и ситуации повеселее, вродеgot uppedилиget upping, но и там, и тут всё решается прицельной зубрёжкой и упорством. Плюс одна из главных причин этой проблемы — отсутствие автоматизма при изменении форм глаголов во время свободной речи. Как только все-s, -ed, -ingи прочие начнут вылетать из вас на автомате, эта проблема, скорее всего, решится сама собой.",
      "Есть ещё и такой момент: одни фразовые глаголы можно разделять, а другие — нет.Turn on the light(включить свет)легко превращается вturn the light on— оба варианта корректны. Ноlook after children(присматривать за детьми) нельзя превратить вlook children after.",
      "Удобного правила для проверки нет, поэтому из советов помимо зубрёжки (дриллинга) только один — пробуйте звучание на вкус. Говорите вслух и прислушивайтесь к себе: если звучит, то, вероятно, прокатит, а для установки соответствующих надстроек в голове придётся завести привычкусмотреть фильмы и сериалыили слушать аудиокниги с подкастами.",
      "Но главная проблема с фразовыми глаголами, конечно, в том, что их много. Тут только погрустить.",
      "Если описанные выше ошибки кажутся вам максимально странными — отлично! Этот уровень вы прошли.",
      "Ещё одна форма высшего пилотажа для продвинутого студента — идиомы. Если вы изо всех сил пытаетесь включить их в речь — честь вам, хвала и никакого сарказма. Они действительно украшают речь.",
      "Из сложностей: иногда, если вы запоминаете много информации без возможности отработать использование каждой лексической единицы до автоматизма, получается микс.",
      "Nah, Mitch won’t do that, trust me. I can read him like the back of my hand.Вольный перевод: Да не, Митч так не поступит, отвечаю. Я вижу его насквозь, как свои пять пальцев.",
      "На английском выглядит будто бы адекватно и звучит удобоваримо, но тут закралась ошибка — во второе предложение влезли сразу две идиомы:",
      "Неверно:",
      "I can read him like the back of my hand.Я вижу его насквозь, как свои пять пальцев.",
      "Верно:",
      "I can read him like a book.Он для меня как открытая книга. Я его насквозь вижу.",
      "I know him like the back of my hand.Знаю его как свои пять пальцев.",
      "Ещё немного классики:",
      "Неверно:",
      "We'll burn that bridge when we get to it.Сожжём этот мост, как только до него доберёмся.",
      "Верно:",
      "It’s time to burn the bridges.Время сжигать мосты.",
      "Let’s cross that bridge when we get to it.Давайте решать проблемы по мере поступления. Дословно: перейдём этот мост, когда до него доберёмся.",
      "В следующем примере смысл не страдает, только форма. Поэтому загадочным взглядом вас, может быть, и окинут, но поймут в любом случае:",
      "Неверно:",
      "Whoa, she’s madder than a wet hornet.Уоу, да она злее мокрого шершня.",
      "Верно:",
      "Mad as a hornet.Злой как шершень.",
      "Madder than a wet hen.Злее мокрой курицы.",
      "У каждого из моих студентов в рамках этого раздела свояpet peeve, и перечислять их можно долго.Повторюсь, больше всего шансов начать путаться в идиомах (и не только) при потреблении новой информации в большом количестве и нехватке времени на её качественную утрамбовку.",
      "Если не нужно спешить к сдаче экзаменов, лучше немного замедлиться и убедиться, что последние пять выученных идиом вылетают из вас «красивыми и румяными» до того, как вы успеете подумать, и только затем приступать к изучению следующих.",
      "I don’t want to go out. Thehumanitylevel is so high. Is it going to start raining?",
      "Заметили что-то не то? Да, бывало в моей жизни такое, что из-за количества людей на улице я предпочитала остаться дома, но в данном случае речь точно не об этом.",
      "Недостаток контекстов и зубрёжки новой лексики в рамках этих контекстов ведёт к тому, что мозг ищет и находит лежащие на периферии сознания слова из набора похожих букв. Особенно сложно с абстрактной лексикой: она вроде бы знакома, попадается в упражнениях или в тестах, но в реальной речи используется нечасто. Из популярного:",
      "Неверно:",
      "Thehumanitylevel is so high. Is it going to start raining?Человечностьтакая высокая, скоро дождь начнётся?",
      "I need a biggerceleryto pay my bills.Мне нуженсельдерейпобольше, чтобы оплачивать счета.",
      "Iexorciseevery morning.Яизгоняю дьяволакаждое утро.",
      "Верно:",
      "The greatness ofhumanitylies in compassion.Величиечеловечествазаключается в сострадании.",
      "Thehumiditytoday is unbearable!Влажностьсегодня невыносимая!",
      "Mysalaryincreased this year.В этом году у меня повысиласьзарплата.",
      "I added someceleryto the salad.Я добавил(а) немногосельдереяв салат.",
      "Iexerciseevery morning.Ятренируюськаждое утро.He had toexorcisethe demon.Ему пришлосьизгнать демона.",
      "А ещёeffect (сущ. результат, эффект)иaffect (гл. влиять, воздействовать), complement (дополнение, комплект)иcompliment (комплимент), moral (мораль)иmorale (боевой дух)и вообще все слова, начинающиеся наex-: except, expect, expand и т.д.",
      "Такие весёлые парочки и компашки полезно разбирать на конкретных примерах — в коротких диалогах, а не списком. Также полезно составлять собственные предложения и, опять же, повторять-повторять-повторять. Вслух. Чтобы заставить мышечную память работать на вас.",
      "В этой дисциплине я без лишних слов передам пальму первенства глаголуdependи его самому популярному ошибочному спутнику — предлогуof.",
      "Неверно:",
      "Her mooddepends ofthe weather.Её настроение зависит от погоды.",
      "Social media greatlyinfluences onteenagers.Соцсети  оказывают огромное влияние на подростков.",
      "Верно:",
      "Her mooddepends onthe weather.",
      "Social media greatlyinfluencesteenagers.",
      "Важный нюанс:",
      "Her attitudehad an influence onmy decision.Её отношение оказало влияние на моё решение.",
      "Ошибки подобного рода обычно вылезают во время разговорной практики. В процессе контролируемой же — в упражнениях, тестах, дриллинге — внимания на предлоги обычно хватает.",
      "Глагол — он про действие и несёт в себе кучу смысла, поэтому кажется функционально важнее, а значит, его запомнить проще, чем пару букв, которые идут после. В результате появляются конструкции вродеlisten music, belong him,а ещёdiscuss about, enter to the roomи прочие — без нужных «спутников» или с лишними.",
      "Эта ошибка — часть более широкой проблемы: предлоги в английском далеко не всегда переводятся дословно. Когда мы говорим по-русски «спорить о чём-то»,логично кажется сказатьdiscuss about.Но глаголdiscussуже включает в себя идею «о чём-то» — поэтому правильно будетdiscuss the problem, а неdiscuss about the problem.",
      "То же самое сenter to the room. У нас мы«входим в комнату»,и вроде хочется добавить предлог направления, ноenterуже означает движение внутрь.",
      "Устойчивые выражения и сочетания с предлогами (verb + preposition collocations) нужно заучивать как цельную конструкцию, иначе они превращаются в угадайку. Вместо того чтобы думать «а какой предлог подходит кlisten?», лучше сразу запомнитьlisten to (music, the teacher, the birds singing)как единое целое.",
      "Классическая путаница: где-ing, где-ed? ФразаI’m interestingзвучит так, будто вы убеждаете в этом себя, а после фразыI’m boringхочется спросить: «Зачем же так самокритично?» Эта ошибка больше свойственна студентам уровня A2, но и на B1 она иногда даёт о себе знать, только с лексикой посложнее.",
      "Просто вспомним, что слова с-edописывают чувства, а с-ingописывают то, что эти чувства вызывает:",
      "I’m devastated.Я опустошён.That’s devastating!Это ужасно!",
      "I’m terrified/frightened.Я в ужасе/напуган.That story’s terrifying/frightening.Эта история ужасная/пугающая.",
      "I’m confused.Я сбит с толку.Their actions are confusing.Их действия сбивают с толку.",
      "I’m overwhelmed.Я переполнен эмоциями.It’s overwhelming.Это слишком.",
      "I’m humiliated.Мне стыдно.That situation’s so humiliating.Эта ситуация такая унизительная.",
      "Для тренировки помимо традиционного уже дриллинга из коротких фраз и предложений можно составлять мини-истории, где вы — герой, который чувствует что-то (например,outraged,возмущённый), а некое событие эти чувства вызывает (outraging,возмутительное).",
      "Любовь всех и вся к наречиюveryискоренить сложно (и я хорошо понимаю всех влюблённых). Это привычный «костыль» для усиления, который мозг вставляет на автомате. Но одно дело, когда студент меняетvery tired(очень уставший) наexhausted(обессиленный), и совсем другое, когда само словоexhaustedобзаводится этим удобным и привычнымvery.",
      "Extreme adjectivesна то и экстремальные, что никакоеveryим уже не нужно — они и без него донесут крайнюю степень описываемого. В моём мире эта проблема решается крайне эмоциональным дриллингом.",
      "СкажитеI’m furious(я разъярён) вслух так, будто у вас кипит кровь, а из ушей идёт пар, а после фразыI’m exhausted(я выжат) добавьте что-то неразборчивое и упадите на кровать (предварительно убедившись, что она перед вами есть). А, и небольшой чит-код: поменяйтеveryнаreally. Тогда и «костыль» останется на месте, и ошибка исчезнет.",
      "Способы выражения будущих действий в английском заслуживают отдельной статьи, потому что их много. Из самых популярных ошибок:willвместоbe going toи наоборот,willво всех типах действий в будущем, вопрос выбора между Future Simple, Present Simple и Present Continuous. А ещё буквально на прошлой неделе меня спросили: «Зачем мнеgoing to, если я могу использоватьI plan to?»",
      "Студенты уровней B1–B2 такие вопросы задают редко и разницу в степени уверенности междуI plan toиI’m going toбез проблем объяснят сами, и на английском. По остальным же случаям мы всё же пробежимся.",
      "Неверно:",
      "Использоватьwillдля запланированных действий:",
      "Iwillmeet my friend tonight.Я встречусь с другом сегодня.",
      "Верно:Вместо will использовать оборот going to или Present Continuous:",
      "I’m going tomeet my friend tonight.",
      "I’m meetingmy friend tonight.",
      "Неверно:Использоватьgoing toдля предсказаний без наличия доказательств:",
      "It’s going torain tomorrow.Завтра будет дождь.",
      "Верно:Вместоgoing toиспользоватьwillдля мнений и предсказаний с высокой степенью уверенности (но без доказательств):",
      "I think itwillrain tomorrow.Думаю, завтра будет дождь.",
      "Либо прикреплять доказательства, и тогдаgoing toокажется в тему.",
      "I’ve seen the forecast! It’s going torain tomorrow.Я видел прогноз! Завтра будет дождь.",
      "Неверно:Использоватьwillдля расписаний:",
      "Our trainwillleave at 8:03 a.m.Наш поезд отправится в 8:03 утра.",
      "Верно:Вместо will использовать Present Simple для расписаний.",
      "Our trainleavesat 8:03 a.m.Наш поезд отправляется в 8:03 утра.",
      "Ещё можно попробовать подумать о времени как о степени уверенности.Will— уверенное, но всё же только мнение о будущем (плюс спонтанное решение),going to— ваши планы (+ предсказания на основе видимых доказательств), Present Continuous — почти договорённость, а Present Simple — факт по расписанию.",
      "Это тот самый тип ошибок, который должен бы быть стилистическим выбором, но что-то идёт не так.",
      "На уровне B1–B2 ученики начинают чувствовать, что могут больше. И это правда — словарный запас растёт, грамматика крепнет, хочется говорить как носитель. Тут и появляется соблазн максимально усложнить речь: использовать редкие прилагательные, пассивные конструкции, идиомы из сериалов.",
      "Но сложность — не всегда плюс. Фразы вродеIn consideration of the aforementioned circumstances, I opted for abstention(Ввиду вышеупомянутых обстоятельств, я предпочёл воздержаться) не звучат впечатляюще, если вы при этом делаете паузы, теряете мысль или путаете слова.",
      "Собеседник скорее подумает: «Что происходит?», чем «Какой эрудированный человек!». Студенты начинают строить предложения-монстры, где каждое слово тщательно выбрано для «впечатления», но вместо живого разговора получается что-то вроде диссертации, зачитанной вслух.",
      "Мне самой максимально импонирует желание приукрасить речь, но нужно чётко определять обстоятельства, в которых можно потренировать желаемое, а в которых лучше тормознуть и сказать проще:I decided to skip it(Я решил это пропустить)— и это будет грамотно и понятно.",
      "Носители языка ценят ясность больше, чем жонглирование словами. Они и сами говорят просто, когда нужно донести мысль, и доказательством этому для меня навсегда останутся диалоги моих коллег-носителей и некоторых коллег-китайцев в офисе нашей школы в Китае.",
      "A:I dropped my ice cream.Я уронил своё мороженое.",
      "B:Ah, a lamentable occurrence resulting in the premature demise of your frozen confectionery delight.Ах, прискорбное событие, повлекшее за собой преждевременную гибель твоего замороженного лакомства.",
      "A:It melted fast.Оно быстро растаяло.",
      "B:That’s the unfortunate consequence of thermal transference in an environment unsuited to cryogenic preservation.Это печальное следствие теплопередачи в среде, не предназначенной для криогенного хранения.",
      "A:I was sad.Мне было грустно.",
      "B:Naturally. Emotional dismay is a valid response to the loss of anticipated gustatory satisfaction.Естественно. Эмоциональное расстройство — вполне закономерная реакция на утрату ожидаемого вкусового удовольствия.",
      "Про мороженое там, конечно, речи не шло, но впечатления от этих диалогов были схожие.",
      "С идиомами та же история: есть вероятность не попасть в контекст. Можно даже не делать грамматических или лексических ошибок — просто неправильно считать ситуацию и озадачить собеседника.",
      "Ну, или качественно заинтриговать. Пожелатьbreak a leg(вольный перевод: ни пуха ни пера) перед экзаменом, например, хотя такое обычно желают перед выступлениями и соревнованиями. Не вот велика беда, но лучше знать эту тонкость заранее и пожелать что-то другое.",
      "Почему так происходит? Дело в том, что на среднем уровне студенты попадают в ловушку синдрома отличника. Кажется, что сложные слова автоматически делают речь лучше. Но язык — не экзамен, где за редкие слова дают дополнительные баллы. Это инструмент общения, и главное его качество — эффективность.",
      "Наращивать сложность важно и нужно, просто постепенно. Уверенно говорить на уровне чуть ниже — полезнее, чем путаться в конструкциях и всё равно по итогу что-то недоучить. Так что не спешите слишком усложнять свою речь, если вы не выступаете на научной конференции и сложный специфический язык вам необходим.",
      "В первую очередь хочется сказать, что ошибки в английском — это знак, что вы им пользуетесь. Но это в том числе и сигнал, что пора отрабатывать конкретные моменты. Давайте рассмотрим техники, которые смогут в этом помочь. Говорю сразу: всё довольно банально, ничего инновационного здесь не будет.",
      "Shadowing или теневое повторение. Суть метода — повторять за носителями, слово в слово, с той же интонацией, темпом и логикой пауз. Берите сериал, подкаст или видео на YouTube — включайте фразу, ставьте на паузу и повторяйте вслух. Да, даже если звучите неидеально — это всё равно помогает запомнить структуру речи на слух и «записать на мышечный носитель».",
      "Хорошо работает сервис playphrase.me — введите слово или фразу, и он найдет видеоклипы из фильмов и сериалов, где носители языка произносят эту фразу в контексте. Сервис работает как поисковик по миллионам кинокадров: вы вводите любую фразу, а алгоритм просматривает обширную библиотеку видео из почти 90 000 источников и показывает сцены, где эта фраза звучит.",
      "В бесплатной версии вы можете просмотреть до 5 клипов за поиск, но есть платная подписка от $3 в месяц, что даёт безлимитные поиски. Также есть возможность сохранять любимые клипы и скачивать их для офлайн-использования. В правом нижнем углу сервис указывает произведение, из которого взят кусок, и таймкод.",
      "Дриллинг или зубрёжка. Иногда учёба — это не интересный квест, а просто повторение. Бывает, что без этого никак — надо собраться, настроиться, сесть и проговаривать одно и то же снова и снова, но здесь важно и качество повторения. Вы берёте конструкцию — например, I'm getting used to it — и проговариваете её в разных контекстах:",
      "I'm getting used to working remotely.Я привыкаю работать удалённо.",
      "I'm getting used to the new schedule.Я привыкаю к новому расписанию.",
      "I'm getting used to speaking English every day.Я привыкаю говорить по-английски \tкаждый день.",
      "Это закрепляет фразу в вашей активной памяти. Необходимо произносить осознанно, представляя ситуацию, а не механически, — только так метод будет работать.",
      "Составляйте свои примеры.Учите не отдельные слова, а словосочетания и целые предложения. Лучше три раза сказатьI’m interested in design(Я заинтересован в дизайне), чем 10 раз повторитьinterested(заинтересован).",
      "Изучать отдельные слова бесполезно, если не знаете, как они работают в предложении. Лучше взять устойчивое выражение — например,to be interested in(быть заинтересованным в чем-то) — и придумать 5–10 своих примеров с ним, начиная с коротких предложений и переходя к длинным.",
      "Это поможет увидеть, как слово ведёт себя в разных ситуациях. Так вы избежите частых ошибок (например,interested forвместоinterested in) и действительно сможете использовать его в жизни.",
      "Работайте с преподавателем.Даже если вы уверены в себе — со стороны бывает лучше слышно то, что вы, например, пропускаете. Преподаватель заметит ошибки, даст обратную связь и поможет тренировать речь в диалогах —всё это есть в Практикуме.",
      "А ещё преподаватель может организовать работу над конкретной проблемой. Например, если вы постоянно путаете времена, он создаст серию упражнений именно на эту тему: будет задавать вопросы, требующие разных времен, исправлять ошибки на месте и предлагать переформулировать фразы правильно. Это и есть тот самый дриллинг — но не механический, а осмысленный. Так вы практикуете нужные конструкции в живом общении, а не просто зубрите списки.",
      "Это особенно важно при сложной грамматике: будущем времени, модальных глаголах, условных предложениях — там, где нужна не просто теория, а умение быстро выбрать правильный вариант в разговоре.",
      "Не ошибается только тот, кто ничего не делает. Мы и на родном языке достаточно косячим: ставим ударения туда, где их не должно быть, говорим «одеть шапку» вместо «надеть» и удивляемся, с чего это «гиена огненная».",
      "В английском таких моментов ожидаемо больше, и это абсолютно нормально. Ваш уровень определяют не ошибки, а то, как вы учитесь их замечать и исправлять. Продолжайте практиковаться: говорите, ошибайтесь, получайте фидбэк, снова говорите. Ищите единомышленников просто для поболтать, занимайтесь самостоятельно и с преподавателем.",
      "Чем чаще вы будете применять язык в реальности, тем быстрее «скользкие» места перестанут вас подводить. Так что — welcome mistakes! Они значат, что вы двигаетесь вперед.",
      "А ещё, если кто-то уже рефлексировал на тему ошибок и может поделиться своими слипами и больными местами, — милости прошу в комментарии."
    ]
  }
}