{
  "title": "Топ-5 бесплатных AI-сервисов для генерации 3D-моделей",
  "views": "418",
  "link": "https://habr.com/ru/companies/bothub/articles/933452/",
  "text": {
    "article_content": [
      "Ещё недавно создание 3D-моделей было задачей исключительно для специалистов. Нужно было знать сложные программы, уметь работать с формой, светом и текстурами. Сегодня всё иначе. Искусственный интеллект уверенно берёт на себя рутинные этапы и даёт возможность любому почувствовать себя 3D-дизайнером.",
      "Чтобы проверить, как всё это работает на практике, мы собрали пять сервисов для генерации 3D-моделей и решили немного повеселиться.",
      "Сегодня мы будем создавать модели персонажей из известных мультфильмов нашего детства!",
      "Да, у многих сервисов нашего топа есть платные подписки. Но сегодня разбираем только то, что работает бесплатно и не просит привязать карту «просто на всякий случай».",
      "Приятного прочтения!",
      "Уже успели оценить обложку в нашей статье?",
      "Мы сгенерировали её в GPT-Image на платформеBotHub!",
      "Здесь доступно сразу5 моделей для генерации изображений, включая Midjourney и Flux,9 нейросетей для работы с текстом— от ChatGPT до Grok, и даже видеогенераторы вродеRunway и Veo. Всё в одном месте и без использования VPN.",
      "А при регистрации по этой ссылке Bothub дарит 100 000 капсов— забирайте бонус и начинайте творить бесплатно!",
      "А мы начинаем!",
      "Это детище Microsoft, и на данный момент оно находится в демоверсии и находится на платформеHugging Face.",
      "Сама нейросеть основана на методеStructured LATent (SLAT), он декодирует входные данные в различные форматы, включая полигональные сетки и 3D-гауссианы. А для его обучения использовался датасет из500 000 трёхмерных объектов.",
      "Она может генерировать трёхмерные модели, но только на основе изображений.Вы можете настроитьсид, силу привязки, количество шагов, алгоритм объединения изображений, настройки извлечения GLB-модели.Также вы можете загружать несколько изображений в режиме«Multiple Images», чтобы показать нейросети объект с разных ракурсов.",
      "Загружаем исходное изображение, ниже выбираем подходящие настройки и нажимаем «Generate»",
      "Для первого теста мы пригласили Микки Мауса. Пока на сцену выходит легенда, нейросеть судорожно ищет, где у него заканчивается нос и начинается рот...Сами увидите!",
      "Итог получился… спорный. Рот почему-то оказался на затылке, лицо смазалось и отпечаталось где-то в районе штанов. Качество покраса на троечку, но узнаваемость на грани фола. Финальную модель можно скачать в формате GLB, а вывести вMP4.",
      "Это онлайн-сервисот Stability AI, который превращает картинки и текстовые запросы в трёхмерные модели.Под капотом находится TripoSR. Работает в браузере, а результат можно скачать в формате GLB. Нейросеть понимает русские промпты. Также доступно7 языков, включая китайский и английский.",
      "Картинку нужно давать в формате JPG или PNG,размером до 4 МБ. Чем проще и чище фон, тем меньше сюрпризов на выходе. Лучше всего Tripo справляется с предметами, техникой, мебелью и всем, что не машет руками и не поворачивает голову набок. Генерация занимаетот 1 до 1,5 минут. В настройках можно выбрать, с какой версией модели работать, задать негативные параметры, настроить позу(A или T), и масштаб модели. Помимо этого, есть 8 стилей генерации.",
      "После регистрации даётся300 монет. Они расходуются на создание моделей (25) и открытие дополнительных функций. На версии 2.5 можно получить5 бесплатныхготовых моделей.",
      "Загружаем исходное изображение или вводим промпт, подбираем стиль, нажимаем «Генерировать»",
      "Для второго теста мы позвали Скруджа МакДака, который еле согласился на бесплатную генерацию. А она, кстати, вышла неплохой!",
      "Если сравнить с фото, вышло очень неплохо, но есть пара огрехов. Очки немного расплылись, а глаза продублировались на клюве, думаю, это можно исправить правильным промптом. Зато покрас на уровне, а персонаж получился узнаваемым.",
      "На последок, за20 монетможно купить анимацию персонажу. Есть бег, борьба и прыжки.",
      "Сервисумеет превращать картинку (желательно с нейтральным фоном и в анфас) и текстовый запрос (желательно на английском) в 3D-модель. На бесплатном тарифе получится создать 10 моделей, будет лимит на разрешение текстур и ограниченный приоритет в очереди.",
      "Из плюсов сразу хочу отметить наличие русского языка, а всего доступно чуть больше20 языков. После регистрации нам выдают100 монет.Генерация длится около2 минут,и в итоге мы получаем сразу4 модели.Также можно выбрать художественный стиль и создать анимацию с нашей моделькой.",
      "Под капотом — архитектура, построенная на диффузионных моделях и fine-tuning на больших датасетах, включая Objaverse и аналогичные библиотеки.Модели выходят в формате GLB или OBJ, с возможностью скачать и доработать в Blender, Maya или любом другом редакторе.",
      "Также доступен Texture Generator. Изначально модель создается без текстуры (черновик). Meshy сам нарисует на неё одёжку. Такие текстуры основаны на нормалях, UV и контексте. Это удовольствие стоит10 монет.",
      "Загружаем исходное изображение или вводим промпт, выбираем позу, модель, симметрию, и нажимаем «Генерировать»",
      "В этом тесте главным героем будет Дональд Дак. Я уже представил, как он разозлится, увидев...шесть пальцев.",
      "Результат оказался между двух огней. Лучше, чем у первого сервиса, но хуже, чем у второго. Персонаж узнаваем, но не тот, на кого приятно смотреть в 4K. Покрас на среднем уровне, местами есть белые проплешины. С руками всё также не очень. Пальцев то больше, то меньше, то одна рука толще другой. Если сравнивать с оригинальной картинкой, поза слегка завалена.",
      "Это онлайн-сервисдля генерации, редактирования и текстурирования 3D-моделей на основе текстового описания (по картинке работает так себе, оживляет плоскость).Каждому новому пользователю при регистрации выдается 250 кредитов, чего хватает на 5 генераций. Если в процессе генерации произошёл сбой, потраченные кредиты возвращаются на счёт пользователя.",
      "После генерации модели можно редактировать вонлайн-редакторе Sculpt, настраивать и вручную раскрашивать текстуры врежиме Paint, а также использовать функцию Auto Retexture для автоматического улучшения внешнего вида.Все модели можно скачать в форматах GLB, OBJ и FBX. Сервис поддерживает работу с текстурами, включая экспорт UV-развёрток и автоматическое наложение материалов.Возможна интеграция с другими 3D-редакторами через экспорт.",
      "Выбираем «Тext-to-3D», вводим промпт и нажимаем «Generate»",
      "Настало время Джинна. На этот раз лампу тёр не Аладдин, а нейросеть. Надеемся, его порадовал хотя бы не пиксельный хвост.",
      "A stylized 3D genie emerging from a magical lamp, floating in the air, with muscular upper body, glowing blue skin, golden accessories, and a swirling smoke tail instead of legs, cartoon-style, friendly face, exaggerated proportions",
      "Сервис всё ещё в бете и по качеству уступает конкурентам. Детализация средняя, а текстуры на уровне черновика. Промту нейросеть следует так себе, но персонаж получился ближе к образу Уилла Смита из фильма, чем к классическому мультяшному Джинну, вместо лампы мы получили котел. Ну, и, посредственный покрас .",
      "Перед вами облачный AI-сервисот Luma Labs, который позволяет создавать 3D-модели по текстовому описанию с фотореалистичным качеством. Генерации не ограничены.Скорость создания составляет 2 минуты, а на выходе получаем 4 образца. После можно просмотреть объект со всех сторон прямо в браузере, без установки приложений.",
      "Сервис умеет генерировать только по промптам.Особенно хорошо ему удаются предметы, техно-дизайн, обувь, оружие, посуда, мебель и техника.С персонажами результат менее предсказуемый: руки, лица и мелкие детали бывают искажены или смазаны. Также пока нельзя выбрать позу, анимацию или управлять материалами.",
      "При экспорте можно выбрать программу, в которой хотите продолжить работу (Blender, Unity, Unreal), и Genie сама подберёт подходящий формат. Доступны:FBX, GLTF, USDZ, Blend, STL или OBJ.",
      "Вводим промпт и нажимаем «Create»",
      "В этом тесте главной героиней будет Ариэль. Хорошо, что она когда-то отдала свой голос, потому что при виде результата очень хочется закричать",
      "A stylized 3D model of a red-haired mermaid princess with a green fishtail and purple seashell top, sitting on a rock, smiling, with flowing hair and big expressive eyes, cartoon style, friendly and colorful",
      "Описывать особо нечего. Результат получился самым слабым из всех. Текстуры кривые, детали смазаны, геометрия местами расползлась. Узнать Ариэль всё же можно, и на этом, пожалуй, плюсы заканчиваются.",
      "Итак, мы протестировали несколько бесплатных нейросетей для генерации 3D-моделей. У каждой свои особенности, с каждой нужно понимание работы. Что скажу, 3D-дизайнеры могут спать спокойно — нейросети далеко не готовы забрать у них хлеб.",
      "С первой попытки получить что-то достойное – как пытаться нарисовать шедевр с завязанными глазами. Приходится пробовать снова и снова, чтобы хоть немного приблизиться к задуманному. Бывает, что в самые “прекрасные” моменты, бесплатные попытки заканчиваются быстрее, чем успеваешь понять, что пошло не так.",
      "Правда в том, что нейросети хороши, но только тогда, когда их направляет человек. Без вашего творческого взгляда, правок и идей они просто набор инструментов, которые способны генерировать стандартные модели, но никак что-то оригинальное. В конце концов, никакая технология не заменит того, кто может вдохнуть жизнь в плоские формы.",
      "Спасибо за прочтение! Делитесь вашими результатами генерации 3D-объектов с помощью нейросетей в комментариях. Возможно, у вас уже есть любимый сервис. Будем рады узнать о Вашем опыте!"
    ]
  }
}