{
  "title": "МММ — прошлый век. Сейчас в тренде ППП — Психологи Платят Психологам (критика волчистой психологии)",
  "views": "3.6K",
  "link": "https://habr.com/ru/articles/933534/",
  "text": {
    "article_content": [
      "Не секрет, что к психологам относятся скептично. Их недолюбливают, их игнорируют, над ними посмеиваются. Их путают с тренерами/гуру/наставниками/тьюторами/духовными лидерами. В общем, считают несколько маргинальными представителями сферы услуг. При этом же, многие люди сталкивают с ситуациями/проблемами/вызовами жизни, когда найти самостоятельно решение или просто стабилизировать себя не получается. И тогда открывается строчка поисковика, вбиваются слова \"психолог в городе N\" или \"психолог онлайн\" и начинается увлекательный квест под названием \"попробуй получить хоть какую-то пользу за свои деньгии не добавить себе проблем\".",
      "И мне, как специалисту в этой сфере (психологии, а не добавлении проблем), хотелось бы раскрыть изнутри ситуацию на рынке психологических услуг России. И объяснить, почему найти адекватного психолога - задачка вообще нетривиальная. И, как на мой взгляд, всё же это можно сделать. Вы сможете погрузиться в мир психологических корочек/рангов/званий, разобраться в вопросе и продолжить не любить психологов. Просто делая это более обоснованно - с аргументами, фактами и ссылками.",
      "В общем, всё то же, что и в IT: неэффективное образование под лозунгов \"войти вITпсихологию\", волчистость, накрутка опыта и слабые попытки госрегулирования. И мой постыдный опыт жизни в этой системе и выхода из неё.",
      "Дисклеймер №1:В силу подхода к работе так сложилось, что обычно я консультирую людей интеллектуального труда. В последние годы это преимущественно управленцы и сотрудники IT‑сферы. Это люди, которые всю жизнь решали любые проблемы «через голову». Такой подход неизбежно накладывает отпечаток на личность и внепрофессиональную жизнь. Минимизацией негативных последствий таких особенностей я занимаюсь. И в рамках статей на данном ресурсе стараюсь обобщить профессиональный опыт и дать полезную информацию.",
      "Дисклеймер №2:Я понимаю, что статья не Хабровская, но с учетом разбора психологического образования именно как системы, думаю, будут люди, которым этот текст покажется полезным.",
      "Начну с признания в паблик. Я не люблю психологов. Серьезно. Если у меня будет выбор - пойти потусить с айтишниками/предпринимателями/врачами/автомеханиками или же с психологами, то я выберу первую категорию. И у меня на то есть свои причины (как минимум, почти пятнадцать лет «вращения» в этих кругах). Хотя есть одно исключение – это академические круги, где различные кандидаты и доктора наук обсуждают интересные открытия, полученные, черт возьми, экспериментальным путем, а не натягиванием сомнительной теории на одного-единственного клиента с посылом, мол, вот она – глубинная причина всех человеческих проблем.",
      "Но так было не всегда. Вспоминая версию себя же университетских времен, я ведь не всегда таким был. Когда-то мне это казалось важным, полезным и, главное, интересным. И я с огромным удовольствием участвовал в олимпиадах, катался на различные профильные мероприятия, проходил обучения. Так когда всё изменилось?",
      "Тут будет кусочек моей истории, который я не пытаюсь экстраполировать на всю страну. Но мне кажется, что он достаточно показательный. Мой профессиональный анамнез, пропитанный жадностью и прагматизмом:",
      "Бакалавриат – моё золотое время. Интересная учеба, классные одногруппники, очень компетентные преподаватели. Искренне убежден, что из доступных мне вариантов я выбрал лучший. Я поступил на коммерцию, меня это угнетало, поэтому я приложил усилия и в середине второго курса перевелся на бюджет. Как только перевелся – практически не слезал с ПГАС (повышенной государственной академической стипендии). Лучшим же моим достижением был фулл-хаус из стипендий: стипендия отличника, ПГАС, стипендия Президента РФ, стипендия Президента РБ (тогда он ещё так назывался). И если большинство моих одногруппников получали по 1500-2000 рублей в 2014 году, я шиковал, как сейчас помню, на 20 500 рублей. На первую машину даже накопил. В связи с тем, что я слегка словил «звезду» и начал слишком активно выпендриваться, а именно:",
      "Начал наезжать на администрацию вуза (мозгов не было);",
      "Заинтересовал своей персоной ФСБшника, который курировал наш вуз (открою тайну, каждый вуз имеет своего «товарища майора», но это отдельная история);",
      "Поругался с профкомом (или с кем-то подобным), ибо искренне считал, что для Высшего, сцуко, Учебного Заведения очень нелогично стипендию за спортивные достижения делать выше, чем за научные.",
      "В общем, со всех стипендий, кроме стипендии отличника я слетел. С «двадцатки» на «двушку» переходить было грустно, поэтому я начал искать работу. Совмещать её с учебой – фигня вопрос, ибо диплом был практически написан, а зачетка не то, что работала на меня, она за меня чуть ли не на пары ходила. Я оформил себе индивидуальный график и открыл ХэдХантер. Посидев на нём недельку, я понял одну вещь. Психологу за месяц, в среднем, платят 12-15 тысяч, а вот тренеру – 25-30 тысяч. Хоть математику я и не любил, но второе число мне чисто интуитивно нравилось больше. К тому же, корочка тренера уже была, благо, я этим ещё на третьем курсе озаботился. Так началась моя карьера в сфере корпоративного образования.",
      "Еще одна интересная штука про бакалавриат и мотивацию обучающихся. На первом курсе у нас был предмет «тренинг-адаптация к вузовскому обучению». Эдакий тимбилдинг с элементами подготовки ко «взрослой жизни». И на нём всем нам задали вопрос, мол, ребята, а зачем вам всё это? Так вот, в ответах 26 студентов прозвучала фраза «чтобы помогать людям» с различными дополнениями. Один человек сказал про армию и что-то еще. И у троих прозвучал тезис «чтобы понять, как работает голова». Из всей группы до конца дошли 24 человек, а в «чистой психологии осталось 6 человек. И половина этой «фантастической шестёрки» - это те три «исследователя головы».",
      "Года до 2018-2019 ничего не менялось. Я поступил в магистратуру и вылетел из неё, ибо не смог совмещать с работой. Я работал тренером, получал неплохую ЗП. Параллельно работал в экспертизе экстремистских материалов иногда, раз в год вел дисциплину по тренингам на вузовской профпереподготовке, развивал «психологию в бокале» (барные тренинги). Пошел на вторую «ходку» в магистратуру. Был доволен жизнью и вообще не идентифицировал себя как психолог. Я так и говорил про себя: «я не психолог, а человек, который немного знает психологию». И вот тогда я еще мог общаться нормально с психологами, ибо моей личной вовлеченности в сферу не было.",
      "Но к новому 2019 году я подвыгорел, корпоративная среда меня откровенно утомила, а денег хотелось и требовалось больше, ибо моя финансовая грамотность оставляла желать лучшего, плюс одна контора меня швырнула на трехмесячную зарплату. В общем, начал думать про увеличение доходов, ибо эта тактика мне всегда нравилась больше, чем сокращение расходов. Я уже тогда активно писал психологические статейки на Б17, на котором, кстати, меня забанили на год за ряд вот таких статей:",
      "Если обратите внимание, то я старался писать заметки каждую неделю. И статьи про откровенную ерунду, которую несут психологи, неплохо заходили. Но администрации сайта не понравилось, что я обижаю тех, кто приносит им деньги (неожиданность-то какая). Поэтому, они сперва мою анкету и мои статьи пессимизировали в выдаче, а потом и вовсе со мной попрощались вот таким способом:",
      "Потом, правда, разбанили, после моего письма с посыпанием головы пеплом. Спасибо им. Без шуток. Несмотря на всю фигню, это гораздо лучше Самопознания.ру, который вообще за гранью добра, зла и здравого смысла.",
      "Но уже тогда у меня промелькнула свежая для меня мысль, что психологи зарабатывают на психологах. Я удивился, но ничего с этим не сделал. Я решил, что это вообще какая-то тупиковая мысль, ведь психологи – это сверхлюди практически: добрые и умные люди «со светлыми лицами», искренне радеющие за всеобщее просветление и осознанность.",
      "Говоря языком коммерции, я был уверен, что психология – это чистый B2C (бизнес для конечного потребителя), а не B2B (бизнес для бизнеса). Тогда я еще не знал, что во время золотой лихорадки больше всех зарабатывают продавцы лопат. А лихорадка уже зарождалась.",
      "Но я отвлекся. Вернемся в 2019 год. У меня были статьи и заметки, был какой-то круг людей, знающий меня по «психологии в бокале». Было желание зарабатывать. Я кинул клич, разместил объявления, поставил ценник, нашел кабинет с почасовой арендой – и начал ждать. Неожиданно, но клиенты начали появляться. И это меня радовало. Я ходил, важно дул щёки и называл себя «психологом». Нет, не так. Психологом! С большой буквы «П». А в самом начале 2020-го года еще и диплом магистра подъехал – полный набор!",
      "А раз я психолог, то мне нужно конкурировать с другими психологами. Что, как известно, является основой маркетинга? Правильно, зыринг и тыринг. И я начал очень активно им заниматься. На том же Б17 просто листал анкеты психологов из своего города, внимательно их изучая. Несмотря на то, что к тому моменту я изучал психологию уже 8 лет, я столько новых слов узнал: ICTF, ICF, МАП, МПАП, АЧПП, АКПП (это не коробка передач), МИП, МИГИП, ОППЛ, ЕАПП и прочие. То ли это варианты ЛСД, то ли названия трамвайных депо, то ли еще какая шляпа. Везде лиги, ассоциации, объединения. Я ненароком уж подумал, что «Лига справедливости» Зака Снайдера – это тоже про психологов кино. В общем, все пафосные и серьезные. А я что, левый? Я тоже хочу быть пафосным! Значит, мне тоже нужна корочка.",
      "Начал копать дальше. Так как психоанализ и гештальт уже тогда были мне не близки, я решил сразу идти к самым адекватным персонажам – когтевранцам…эээ… в смысле, когнитивистам. Загуглил ассоциации, выбрал самую крупную и крутую, на мой взгляд – Ассоциацию Когнитивно-Поведенческой Психотерапии, у которой на сайте есть вот такой повышающий профессиональную самооценку блок:",
      "Так как мама мне с детства говорила «скромность украшает того, кого больше ничего не украшает», я просто заполнил анкету, написал сопроводительное письмо, мол когнитивист я до мозга костей, очень люблю КПТ, прямо всей душой. Продал родину, продал родных, и вот теперь хочу купить себе ламповую корочку КПТ-шника. Продайте, пожалуйста. Обращу внимание, что кроме академического образования у меня на тот момент не было ничего. Бакалавриат, магистратура и корочка тренера. Мне приходит в ответ письмо, мол внесите посильный вклад, в смысле, членский взнос. Сказано – сделано:",
      "Я появился на их сайте, а через месяц-другой получил карточку на почту (фотка упоротая, но очень мне нравится). Кстати, карточка хорошая, зимой удобно стекло машины ото льда очищать.",
      "Итак, на дворе 2021 год. Я всё еще работаю тренером/руководителем обучения/HR-директором в разных конторах и параллельно веду практику. Сплю и вижу, что когда-то она сможет мне приносить доход, сопоставимый с зарплатой, чтобы я мог уйти из найма. Уйти в моменте я не мог, ибо, повторюсь, моя финансовая грамотность и так страдала, финансовое здоровье тоже, а ковид ему просто втащил с ноги. В общем, всё идет нормально, в целом.",
      "Несмотря на то, что я когнитивист, профильного образования и соответствующей корочки у меня нет. Есть насмотренность и начитанность, есть практика, но нет корочки. Я ищу курсы по КПТ, но всё кажется каким-то компромиссным. Единственный курс, который меня реально интересовал, это двухгодичная программа КПТ от МГУ. Я несколько раз им отправлял письмо, но ответа не получал. Потом был забавный диалог с преподавателем МГУ, который набирал спикеров на их психологическое мероприятие:",
      "Кстати, программу потом сократили и моё приглашение отменили. В общем, не клеится у меня как-то с МГУ.",
      "Ну, раз реальное образование мне недоступно, то будем смотреть в сторону корочек. А тут-то вообще раздолье – от тотального лоукоста до настоящего образовательного лухури. Вы же всё еще помните, что я жадный прагматик? Надеюсь, что да. И я тоже это помнил. Следовательно, просто открыл сайты с предложениями КПТ-курсов, после которых дают корочку «профпереподготовки». Почему именно её? Потому что большинство профильных сайтов и агрегаторов требуют приблизительно от 500 часов обучения в конкретном направлении.",
      "Схема тут еще проще, чем с АКПП. Просто пишешь письмо такого содержания «у меня есть деньги, а у вас образовательная лицензия. Я готов обменять немного сладких вкусных денег на вашу бесполезную корочку». Им моё предложение понравилось и мы виртуально пожали руки.",
      "Тут я могу соврать, ибо не помню точно. Либо я оплатил обучение в декабре 2021 года, либо в январе 2022 года. Отдав кровно заработанные 10 тысяч рублей, я получил на электронку письмо с ссылкой на Яндекс.Диск, где было полтора гигабайта информации. Сканы книжек, пдфки различные, прочая литература с водными знаками. И сообщение, мол, не зевай, товарищ:",
      "Выбрав тему из предложенных, я и тут решил немного сэкономить, говоря откровенно. Взял что-то по зависимостям, так как у меня уже была магистерская на эту тему. Около недели я её редактировал, правил, переписывал. Уменьшил размер и осмысленность. Удовлетворился проверкой на антиплагиате (а там критерий был около 50% уникального текста). И отправил всё это. Все приняли без проблем, а через пару недель у меня на руках уже был диплом, что я вообще когнитивный терапевт просто лучший.",
      "Но был еще один момент, который меня напрягал. Везде звучали эти мерзкие слова про личную терапию и супервизию. И среднестатистический психолог козырял 100 часов личной терапии и 50 часами супервизии. Чтобы сделать всё по уму, требовалось примерно два года и около 400 тысяч рублей. Звучит точно не как сделка века. Но на помощь пришел здравый смысл и хитрость! Так как нет никакого реестра психологов и сессий у психологов, то получить хоть как-то объективную информацию, ходил я куда-то или нет – невозможно. Звучит как план! Я написал двум подругам с факультета, которые тоже пытались «войти в психологию». Одну попросил написать рекомендательное письмо, мол «я такая-то такая, провела с Сергеем Вячеславовичем 100 индивидуальных консультаций. Дата/подпись». Вторую же попросил аналогичным образом подтвердить мне 50 часов супервизии. Уточнение: написать от руки, поставить автограф, отсканировать и отправить мне. А я им оказываю аналогичную услугу.",
      "Итак, мы в феврале 2022 года.Потратив 11 тысяч рублей – аж почти целый МРОТ по тем временам в моем регионе, я стал важным человеком: практикующий психолог с базовым психологическим образованием (бакалавриат и магистратура), прошедший профессиональную переподготовку по когнитивно-поведенческой психотерапии и являющийся действующим членом Ассоциации Когнитивно-Поведенческих Психотерапевтов (г. Санкт-Петербург). Ну звучит же? Сразу можно ценник повышать.",
      "Таким образом, пройдя еще пару собеседований, меня были готовы взять в психологический кипрский стартап на хорошие условия (оклад у психолога на агрегаторе – ну не чудо ли?). Работа из дома, без продаж и без процентов с сессий, с оплатой х2 от любого психологического центра в моём городе. Я уже уволился с работы и предвкушал прекрасную безбедную жизнь. 21 февраля я получил «рыбу» договора для проверки условий и заполнения. А дальше случилось то, что случилось. И кипрский стартап меня благополучно отшил.",
      "Было грустно, безденежно и безработно. Я без особых проблем нашел себе неплохое место по старому профилю и выиграл время для дальнейшего становления. И тут подумал: «Если один зарубежный агрегатор меня прокатил, может быть, найду кого-то из местных?». Опять шерстим интернет, опять анализируем информацию, опять рассылаем резюмешки и проходим собесы. Совокупно, я прособеседовался во всю первую страницу выдачи Яндекса на тот момент: Зигмунд, Ясно, Ютолк, ТолкТолк, Профиру и что-то еще. Запомнилось мне несколько собеседований. Но начать хочу с Профи, ибо там максимально любопытная история.",
      "Сразу уточню, что информация актуальна на 2022 год, сейчас могло всё поменяться. В общем, там легко зарегистрироваться как психологу. Анкета, диплом и всё. Но! Чтобы предлагать свои услуги, нужно подтвердить своё образование по выбранному профилю (в моем случае, это КПТ, список одобренных курсов находится поссылке). Разумеется, моей шараш-монтаж конторы в нем не было и меня отбрили. Я не особо расстроился, ибо и не надеялся. Я решил, что они молодцы – проверяют курсы, чтобы у них были только хорошие специалисты. Респект! Но тут был нюанс.",
      "Моя коллега, которая целилась именно в Профи, прошла обучение в одобренной организации. Действительно прошла, за нормальный прайс (а не как я), получила диплом, получила право презентовать себя на Профи. И даже какое-то время нормально поработала, в районе полугода. А потом Профи изменили список одобренных курсов, в новом списке её заведения не оказалось, и её аккаунт урезали в правах с посылом, мол, доучитесь и приходите.",
      "И здесь можно, конечно, рассуждать, что они просто бдят за качеством образования. Но у меня есть маленькое подозрение, что курсы попадают в одобренный список не просто так. Повторюсь, просто гипотеза, но что-то мне подсказывает, что в ней есть толика здравого смысла. И даже если отбросить все подозрения, с точки зрения бизнеса – это не очень корректное поведение, на мой скромный взгляд. Ну да ладно.",
      "Профи был для меня закрыт. Зато всех остальных моё резюме устраивало с запасом. Так сказать, этап HR-а прошел везде, дальше дело было за техническим собеседованием. Здесь отличился сервис Ясно. Это был мой личный восторг, который я не могу скрывать. Все вопросы по знаниям я прошел без особых проблем. Дальше меня спросили, как бы я начал решать такой кейс – и описали ситуацию. Я начал накидывать гипотезы и методы их проверки. В какой-то момент меня остановили и произошел приблизительно следующий диалог:",
      "- Сергей, это всё понятно, но вы ничего не сказали про психотерапевтический контракт. Вы как его заключаете? На какой срок?- Обычно я проговариваю условия и формат работы, стоимость, вопросы конфиденциальности и безопасности. Срок я не оговариваю на первой сессии, могу лишь выдвинуть свои предположения. Ведь запросы и клиенты разные – я не могу ставить диагноз по фотографии.- Ну вы сами на какой срок работы с клиентом рассчитываете?- Я работаю в методе краткосрочной терапии, это обычно 5-7 сессий на запрос. Новый запрос – новый срок.- Вы очень поверхностны. Мы с клиентами заключаем психотерапевтический контракт на срок от года.- От года? А если клиенту столько не нужно?- Это значит, что вы слишком поверхностно работаете, а мы заинтересованы в глубинной проработке.- То есть, вы считаете, что каждому клиенту нужна минимум годовая терапия? А если его запрос не требует этого? Это же просто подсаживание на психологическую иглу.- Давайте не будем морочить друг другу голову, мы с вами не сойдемся, так как мы ориентированы только на долгосрочную работу.",
      "На этом собеседование закончилось. Я, говоря так по-русски, слегка очешуел от происходящего. Решил, что это интересный момент, который я буду озвучивать на собеседованиях. Какие еще я услышал ответы?",
      "- В этом случае, ни вы, ни сервис не заработаем.- Мы тратим примерно от одной до трех стоимостей сессий на привлечение клиента, следовательно, он может не окупиться. А это не в наших интересах;- Я вас понимаю, это очень здорово, только начальству не говорите о такой своей позиции;- Пусть так. Главное, что вы мужчина, а у нас дефицит психологов-мужчин, а спрос на них есть. Мы согласны.",
      "Несмотря на то, что заметки я разные пишу уже более 15 лет, мне сложно передать степень того бамболейло, которое у меня творилось в голове. Честно говоря, хотелось всё послать к черту и забить на эту идею. Но, жадность и прагматизм, не забываем. Я выдохнул, успокоился по мере возможностей, и решил искать клиентов сам. Как я размышлял? «Грядет финансовая жопка и я рискую оказаться ровно между булок. Это неприятно. У кого будут деньги? Хм, вероятно, у айтишников и предпринимателей. А где тусуются айтишники? Вроде есть такой сайт Хабр. О, пойду писать туда!». В то же время я отправил первую статью в «песочницу».",
      "Чуть не забыл. Агрегаторы выставляют прекрасную мотивацию. К сожалению, не помню точные цифры, плюс, инфляция. Но логика общая такая. Допустим, консультация стоит 4000 рублей. Что с этого получает психолог, сколько достается ему?",
      "Первая консультация– ничего или рублей 700;2-3 консультации– 1500 рублей4-6 консультации– 2300 рублей7-9 консультации– 2800 рублей9+ консультации– 3200 рублей",
      "Могут меняться цифры, может меняться иначе процент, может быть первая дороже, может быть с 10-ой консультации психолог получает полную ставку (ведь маркетинговый бюджет отбился). Но логика такая. За всё время я увидел только один сервис (раньше их было два, но второй поменял логику работы со специалистами), где этого механизма бы не было. Говоря иначе, или психолог навязывает свои сессии, или он не зарабатывает. Третьего не дано. А нет, дано. Некоторые психологи просто уводят клиентов с сервиса в «личное пользование». Сервисы недовольны, зато психолог и клиент – вполне. Отсюда простой лайфхак – если вам понравился психолог, то просто найдите его контакты и напишите напрямую. Будет дешевле. Но вернемся в 2022 год.",
      "Дальше мою историю на Хабре многие из вас знают. Всё шло без особых изменений год. Я писал статьи, но ничего не менялось. За это время я создал ТГ-канал, чтобы аккумулировать аудиторию. Книжку еще издал (тоже для статуса). А затем написал статью про секты, которая «выстрелила», вошла в топ самых популярных за 2023 год. И вот она привела первую заметную волну клиентов, что в перспективе полугода позволило реализовать старую мечту и уйти в психологию с головой.",
      "Но я же персонаж неугомонный, мне стало интересно, а как продвигаются другие психологи? Где ищут клиентов? На Хабре же их не так уж много и большинство из них получают полную панамку (далеко не клиентов). Я решил копать далее. И любопытства ради начал изучать отраслевые стандарты, если их так можно назвать. Вопрос поставил себе таким образом «Сколько нужно проинвестировать в образование, чтобы начать зарабатывать?». И искать ответы начал с изучения сайтов тех самых ассоциаций.",
      "Если брать АКПП, членом которой я являюсь (на самом деле, уже нет, так как их письма с требованиями об оплате членского взноса ушли в папку спам – это я узнал, пока писал данный текст). Если по актуальным ценам, то это выглядит так:",
      "Базовый курс– 210 тысяч рублей;Продвинутый курс– 275 тысяч рублей;Супервизионный курс– постеснялись написать цену, зато внесли уточнение:",
      "С учетом средней стоимости в районе 700 рублей за академический час, оптимистично предположу, что супервизионный курс стоит около 140 тысяч рублей (ибо он короче предыдущих). Итого мы получаем: 210 + 275 + 140 = 625 тысяч рублей, чтобы получить «право осуществления профессиональной деятельности по данному виду деятельности». Как меня так умиляет эта приписка, вы бы знали!",
      "Ликбез. В России деятельность психологов никак не сертифицируется и не лицензируется. Вообще. Каждый из вас может назвать себя психологом и продвигать свои услуги. Это вообще не наказуемо. Единственное ограничение – вы не можете работать в государственных учреждениях психологом. Всё. Этот вопрос пытаются решить уже давно, но каждый новый законопроект на эту тему термоядернее предыдущего. Поэтому, воз и ныне там.",
      "Что вы получаете за 625 тысяч? Аналог моего диплома за 10 тысяч рублей и возможность работать на Профиру. И размещение на их сайте. Первый и третий пункты я получил за 11 тысяч рублей. Стоит ли возможность размещаться на Профиру 614 тысяч рублей – вопрос открытый.",
      "Окей, допустим, это когнитивисты. А одним из основателей именно этой ассоциации является небезызвестный доктор Курпатов. Может это он так повлиял? Я не знаю. Давайте посмотрим на гештальтистов. Это же нормальные ребята! Буду смотреть московский филиал, чтобы сопоставить можно было с АКПП.",
      "Переходим на их сайт, видим описание, что есть две ступени: первая и вторая. Включаем калькулятор и начинаем подсчет:",
      "Первая ступень – 102 тысячи рублей (считаю по минималке)Вторая ступень – 404 тысячи рублей (а вот если бы успели до августа записаться, смогли бы урвать всего за 396 тысяч рублей)",
      "Пока выходит даже выгоднее, чем у жадных когнитивстов, чтоб пусто им было, да? Но погодите, тут всё интереснее. Здесь нет просто супервизии, тут начинаются специализации. А вот это уже гораздо прикольнее, ибо количество специализаций не ограничивается ничем, кроме здравого смысла.",
      "Там еще парочка есть специализаций, но для понимания порядка цен будет достаточно и этих. Минимальная стоимость – 138 тысяч рублей.",
      "Итого у нас 102 + 404 + 138 = 644 тысячи рублей. Сумма некислая. Но если у кого завалялось пол-мульта на карточке, то почему бы и да? А теперь обратим внимание на раздел «сертификация». Ведь все же хотят быть сертифицированными, верно?",
      "Итак, нам нужно 150 часов личной терапии. Классно, что они заботливо предлагают «рекомендованных терапевтов». Такие пусечки, переживают, что иначе-то бедные студенты себе терапевта не найдут. Смотрим этот список.",
      "Средняя стоимость часа, как услужливо подсказывает гугл, составляет 7300 рублей. Следовательно, за 150 часов терапии мы имеем 1 095 000 рублей. Если прямо экономим на себе любимом, то ищем самого дешевого терапевта, который берет 4000 рублей. В этом случае, можно уложиться всего в 600 тысяч рублей. Что вместе с обучением даёт ценник в 1 244 000 рублей.",
      "Обращаю внимание, что это всё не учитывает получение базового психологического образования, которое должно быть.",
      "Вдохнули. Выдохнули. Куда дальше? А давайте в психоанализ, чего уж там? Гулять так гулять! Справедливости ради, пока это самое доступное предложение из ранее рассмотренного:",
      "Еще есть программа для продвинутых психоаналитиков. Судя по всему, обязательной она не является, но она есть. Стоит вполне умеренно – всего 80 тысяч рублей. Но тут та же мякотка, что и в гештальте – чтобы стать сертифицированным психоаналитиком, нужно быть в терапии у уже сертифицированного психоаналитика. И тут стандарт жестче – уже 250 часов. Ценники плюс-минус такие же. Возьмем гуманные 4000 рублей. Это нам даст ровно 1 миллион рублей, инвестированных в свою проработанность. Итого – 1 420 000 рублей. Или ровно полтора миллиона, если мы хотим быть продвинутыми.",
      "Справедливости ради, в КПТ тоже есть требования к личной терапии и супервизии, но часть из них зашита в стоимость курса. Насчет гештальта и психоанализа – не знаю, ручаться не могу.",
      "Кратко резюмируем. Вложив от 625 тысяч до полутора миллионов вы получите... А ничего, собственно, вы реального не получите. Корочку о профпереподготовке. Всё. Аллес. Всё остальное, что вы можете получить (или не получить) зависит только от вас. Ровно, как и в университетском образовании.",
      "Хотя нет, вру. Есть приобретение. Вы получите возможность зарабатывать на начинающих психологах, которые верят в то, что это им поможет уйти в частную практику. Или на тех, кто целенаправленно идет по этим ступенькам, чтобы самим зарабатывать на психологах. Помните, что я писал в начале про В2С и В2В? Так вот вам моё скромное мнение. Психолог, который работает только с психологами, не будем использовать слово «разводит», теряет профессионализм и становится педагогом. И это прекрасно. Но больше он не психолог. Навыки – уходят. Чуйка – теряется. Тренды – пропускаются мимо. Человек может быть чудесным педагогом, но с этого момента он профессионально деградирует как самостоятельная психологическая единица.",
      "Поверьте, я знаю, о чем говорю. Я сам вел в личной терапии психологов, и супервизии КПТ-шные проводил. Это очень легкие и удобные клиенты. Прямо вот лайт. В отличие от обычных живых людей, которые психологам не особо доверяют (и у них есть на то основания, не правда ли?).",
      "И все эти звания, титулы и прочие лычки – они нужны психологам, чтобы выё…живаться перед другими психологами. Клиенту со стороны вообще плевать. Он просто в этом не разбирается. Какая там разница между ICF и ICTF, чем отличаются МИП и МИГИП, какие там есть уровни, что за супервизии и интервизии? Вот в России есть много мемов про ряженых казаков, у которых медалями вся грудь увешана, хотя я давно не слышал про какие-то победы. И эти медали им нужны, чтобы производить впечатление либо на своих же, либо на тех, кто вообще не в теме. И все эти звания у психологов – такая же шляпа.",
      "Есть казачьи медали, а есть медали от Министерства Обороны. И ко вторым – никаких вопросов (еще бы они у меня были с учетом действующего законодательства). Есть сертифицированные КПТ-терапевты второго уровня гештальт-психоанализа, а есть кандидаты и доктора наук. И ко вторым – тоже ноль претензий.",
      "Заметьте, я даже не упомянул в тексте курсы от различных скиллбоксов, эдисонов и прочей онлайн-пурги, которые обучают всему, за что готовы платить. Черт с ними, они просто закрывают рыночную нишу наряду с университетами. Но после них люди попадают в жернова той же системы. Просто добавьте к итоговому чеку еще пару-тройку сотен тысяч рублей.",
      "И вся эту ситуация стоит на трёх китах:",
      "Отсутствие какой-либо вменяемой регуляции сферы психологических услуг;",
      "Большое количество загонов в голове тех, кто идет учиться на психолога;",
      "Отсутствие понимания у психологов, как им искать клиентов.",
      "И вот давайте во всем этом разбираться.",
      "Отсутствие регуляции.Так как психология относится к гуманитарным наукам, к ней применяются те же принципы, как и к другим представителям этой области. Фактически – делай всё, что хочешь. Любая регуляция – моральная, а не законодательная. Допустим, психолог совершил что-то неэтичное. Например, воспользовался доверием и переспал с клиенткой. Что ему грозит? С точки зрения закона – ничего, так как было согласие, а при каких условиях оно дано, вопрос десятый. С точки зрения профессионального сообщества – максимум, исключат из «клуба» и лишат возможности… шучу, не лишат ничего, ведь они ничего и не дают.",
      "С учетом того, что регуляция психологической деятельности и психологического образования – это просто огромный пробел, то, как это и случается в мире, его заполняет бизнес. Отсюда берут начало все курсы и онлайн-школы. Не они какие-то плохие, просто пустует ниша, так что, почему бы и да? А уж под каким соусом будет подан продукт: под онлайн-курсами, ассоциацией или лигой – это дело вкуса и маркетинга.",
      "Загоны начинающих психологов.Тут звезды вообще сходятся. С одной стороны, это специфичная сфера, в которую идти за деньгами – действие не самое логичное. С другой – психология всеми правдами и неправдами пытается забрать себе роль особой науки, занять некую особую роль. Вспомнить тот же треугольник Кедрова:",
      "С третьей стороны – многие выбирают обучение на психолога вместо курса личной терапии, а значит, страдают синдромами самозванца, низкой самооценкой, повышенной конформностью и прочими, очень удобными для продажников в сфере психологического дополнительного образования, качествами. Есть спрос – есть предложение.",
      "Продвижение и поиск клиентов.Здесь тоже не всё гладко. Так как большинство психологов учились у преподавателей, которые либо сами начинали работу в советском союзе, либо же были представителями «первой волны» отечественных психологов, то транслируются адекватные, в общем-то ценности образования, стажа, опыта и всего иного доброго и светлого. Проблема в том, что сейчас только этого недостаточно. И опять на помощь приходит бизнес. Курсов, вроде «как психологу выйти на доход 100 тысяч в месяц» просто туева хуча. Мне раз в неделю стабильно звонят спамеры, предлагая свои услуги. Можно, кстати, добавить ценник курса к предыдущим калькуляциям. Люди пробуют, но это не помогает – либо они ленятся/боятся вести соцсети и блоги, либо же становятся одними из тысяч однотипных аккаунтов.",
      "И вот тут появляются еще два «персонажа» в нашем рассказе. Это агрегаторы, о которых уже шла речь ранее. И индивидуальные специалисты по «распаковке личности». Распаковка личности – это восхитительное определение, очень нравится. Грубо говоря, это маркетологи и СММ-щики, которые набили руку на психологах и знают, как привести клиентов. Работают либо на окладе, либо на проценте. Процент составляет, в среднем, стоимость 1-2 консультаций с каждого клиента. А это значит, при среднем сроки жизни клиента, допустим, в 10 сессий, в стоимость закладывается дополнительные 10-20-30% маркетингового бюджета, который ложится на конечного потребителя, то есть, вас.",
      "Еще момент про продвижение. Меня лично раздражают три момента, которые встречаются у многих «профессиональных аккаунтов» - это надменное хлебало, фотогеничное хлебало и скриншоты отзывов о консультации с вот такими смайликами (руки в молитве). Кратко о каждом из них:",
      "Надменное хлебало.Почему-то у нас в России до сих пор главным показателем экспертности является способность скроить максимально надменное хлебало и удерживать его на протяжении рабочего дня. Это встречается и у когнитивистов, и у психоаналитиков (у психоаналитиков он еще иногда сочетается с костюмом-тройкой). Тут мне нравятся гештальтисты – они от этого избавлены. У них свой вариант – одухотворенное хлебало. Инноваторы, однако!",
      "Фотогеничное хлебало.Так как раньше запрещенограм был основной площадкой для поиска клиентов, то стандартный пост выглядел как «студийная фоточка + чужая псевдоинтеллектуальная фраза». И как я больше 10 лет назад бомбил на то, что вуз платит спортсменам стипендию выше, чем ученым, то потом бомбил на то, что психологи продают лицо (и если лицо, то это еще неплохо, а то встречал и такие предложения):",
      "Благо, с пессимизацией запрещенограма и резким падением аудитории, многие психологи перебрались в телегу, а это территория текста. В общем, эту войну многие не пережили.",
      "Скриншоты отзывов.Здесь поводов для восторгов целых два. Во-первых, а кто-то им еще верит? В том плане, что это анонимный отзыв без каких-либо пруфов. Можно самому себе писать сообщения, можно знакомых просить, можно просто воспользоваться сервисом в интернете и генерить такие отзывы сотнями. Да что уж там, можно просто взять отзывы у других психологов, в которых нет обращения по имени, и выложить у себя. Во-вторых, но это уже мой загон, это нарушение конфиденциальности. Я считаю, что работа между клиентом и психологом и любой контакт должен оставаться между клиентом и психологом. Вот такой я занудный. Приведу пример: я работаю психологом в вузе, ко мне на консультации приходят преподаватели и студенты. И если я встречаю их в коридоре, то я с ними не здороваюсь и не контактирую первым, потому что не знаю, будет ли им комфортно. Если они проявят инициативу, без проблем, с радостью поддержу диалог. Но вторгаться в их личное пространство за пределами кабинета/консультаций/переписок не буду. Но это мой личный принцип, и предъявлять за его нарушение другим людям будет как-то некорректно.",
      "И вот вы, как потенциальный клиент психолога, оказываетесь в очень интересном положении, которое называется «раком - каком к верху»:",
      "Членство в ассоциации не значит ничего, кроме того, что психолог занес уверенные бабки конкретным лицам;",
      "Все лычки, звания, образования тоже не значат ничего, кроме потраченных денег;",
      "Отзывы, личная терапия и супервизия вообще просто слова без возможности подтверждения;",
      "Агрегаторы зарабатывают на вас, предлагая психологов по оверпрайсу и стараясь увлечь вас в этот процесс на как можно больший срок.",
      "И всё это называется «дикий рынок», каким психология сейчас и является. И вот тут возникает вопрос «Серёжа, блин, как всё здорово очень, а как же, так сказать, найти кого-то адекватного?». Понимаю ваш вопрос. И тут мы делаем камбэк в начало этой эпопеи и вспоминаем про сайт Б17, который я искренне считаю лучшим из того, что есть. Уже много лет у него есть классная функция, которая называется «демо-консультация». Если кратко, то это возможность бесплатно пообщаться в текстовом формате с психологом. Клиент получает небольшую консультацию, психолог показывает свой подход и свою компетентность, так как эта демо-консультация остается в свободном доступе для всех желающих. А еще есть форум, где психологи в «коротком метре» тоже показывают свою работу.",
      "И на мой скромный взгляд, именно вот такая экологичная демонстрация работы и является чуть ли не единственным адекватным способом выбрать психолога, чтобы он хоть немного вышел за пределы роли «кот в мешке». Из такого рассуждения, кстати, и появилась рубрика «анонимный вопрос психологу», которая уже насчитывает более 350 вопросов-ответов. Что меня очень радует.",
      "Как я не единожды говорил, я играю сам с собой в игру «а может ли доброта быть выгодной?». И пока я не проиграл. Не выиграл, конечно, но точно не проиграл. Но тут важно уточнить, я не перестал быть жадным и прагматичным. Но смог построить, по моему мнению, вполне рабочую бизнес-модель:",
      "Нет затрат на рекламу (вообще ноль);",
      "Нет «подсаживания на психологическую иглу» (я все еще за краткосрочную терапию, средний «срок жизни клиента» у меня около 5-7 сессий);",
      "Самозапрет на повышение стоимости действующим клиентам (очень мотивирует работать лучше, чтобы клиентская база обновлялась);",
      "Бесплатная демонстрация своей работы (те же анонимные разборы, вебинары, выступления, конференции, статьи и прочее).",
      "И всё это, хочу заметить, практически без торговли своим (весьма симпатичным, надо сказать) хлебальником.",
      "Очень хочется, чтобы психология, наконец-то, стала адекватным рынком услуг. Не магии, не херомантии, не решения всех проблем. Просто услуг. Но в данных условиях рынка, к сожалению, я пока не вижу условий, чтобы ситуация как-то поменялась.",
      "Я тут перечитал текст и понял, что нужно кое-что пояснить, а то я звучу как плод порочной связи Остапа Бендера с Базаровым. Поэтому, пройдусь по основным моментам:",
      "Учиться на психолога нужно.Без хорошего базового образования, ваш предел, вероятно, это работа по книжкам жанра популярной психологии. База есть база. Несомненно, бывают самородки, но университетское образование крайне желательно. Именно бакалавриат и магистратура. В исключительных случаях – профпереподготовка. Но тут столько «но», что я бы её учитывать не стал.",
      "Личная терапия – полезная штука.Особенно, если вы не сухой когнитивист-зануда (как я), а работаете более лично, эмоционально и глубоко. Справедливости ради, нужно отметить, что я и сам ходил к психологам на ту самую \"личную терапию\", это действительно может быть полезно. В противном случае, рискуете начать периодически пороть чушь. Но сертифицированный это будет психолог или нет – дело десятое. Еще важный момент – если вы «не проработанный», то, вероятно, вы для себя закроете ряд потенциальных целевых аудиторий. А это уже просто невыгодно.",
      "Супервизия – вообще мастхэв.Сюда отнесу и интервизию, и балинтовские группы. На начальных этапах – мега важно. Потом – по запросу. Но без начала практики – не имеет никакого смысла ровным счетом. Опять же, проверено на личном опыте. Без \"старшего товарища\" начинать трудно, особенно, если осознавать риски (преимущественно, риски клиента).",
      "Ассоциации/лиги/объединения– по задумке своей, вещь-то классная. Но преимущественно направлена на извлечение прибыли из начинающих психологов, и формирующая такой же подход у них. Есть ощущение, что сейчас это больше деструктивная история, чем продуктивная. Сообщество энтузиастов-единомышленников тут более перспективно, на мой взгляд (но тоже с оговорками). Но самооценку, контент для соцсетей и социализацию вполне может дать.",
      "Агрегаторы– тоже, по задумке, хорошая вещь. И от них может получить пользу и клиент, и психолог. Но это будет очень компромиссное решение. Если клиент приложит усилия, то сможет найти либо более сильного психолога за тот же прайс, либо такого же психолога, но дешевле на треть. Психолог же, если приложит усилия, сможет не зависеть от агрегатора и получать 10-20-30% «сверху» с каждого клиента. Но если же нет сил/желания прикладывать усилия или же надо «вотпрямощас», то агрегатор – хорошая штука. Как стартовая точка – вполне, как партнер на протяжении всего пути – сомнительно.",
      "И немного рефлексии по поводу своего пути. Я им не горжусь. Там были и не слишком этичные моменты, и не самые правильные, и достаточно провокативные. Наверное, что-то я бы сейчас сделал по другому, но в тех обстоятельствах, делал то, что мог. И я этого не стыжусь. Есть такая фраза «правильно выбранное образование никогда не бывает оконченным». И я ей следую, потому что действительно люблю то, что делаю. Но делаю это с выгодой для себя и других. Но «ленивых» психологов и паразитирующую на теме околопсихологическую шоблу не люблю до сих пор. Просто теперь делаю это обоснованно.",
      "А закончу простой мыслью. Быть добрым – выгодно, нужно только включить голову.",
      "С уважениемСергей Максимов.Психолог.",
      "P. S.В своёмТГ-каналея отвечаю на анонимные вопросы. Только ответы и статьи, без мемов и спама."
    ]
  }
}