{
  "title": "Этапы и принципы развития навыка говорения",
  "views": "3.3K",
  "link": "https://habr.com/ru/articles/933984/",
  "text": {
    "article_content": [
      "Есть 2 разных способа говорения на иностранном языке. Они именнопринципиально разные– как лазерная и струйная технологии печати. И нарабатываются по-разному. Непостижимым образом многие, кто мечтает «заговорить», этого не осознают. Речь пойдёт и о менее очевидных моментах развития навыка говорения. Это улучшенная версия старой статьи.",
      "«Гло́кая ку́здра ште́ко будлану́ла бо́кра и курдя́чит бокрёнка». Эту фразу из несуществующих слов предложил в начале XX века академик Л.В. Щерба. Из неё ясно, что «будлану́ла» — действие, которое ку́здра (ж.р.) совершила в отношении бо́кра (м.р.); бокрёнок, скорее всего, детёныш бокра. Для русского это очевидно сразу. Иностранцу придётся сначала выучить русский. Фраза показывает, что язык — это НЕ СЛОВА. Слова легко переходят из одного языка в другой.Язык—это принципы, по которым слова связываются друг с другом.",
      "В том, чтобы научиться говорить, ничего сложного нет — проблема это придуманная. А все неудачи от того, что люди, как говорится, put the cart before the horse, ставят телегу впереди лошади. Пытаются говорить, не понимая, как связываются слова в языке. Это как пытаться бегать, не научившись ходить.",
      "Не будем обсуждать руссо туристо, объясняющихся знаками и инфинитивами. Выделим три уровня «говорения»:",
      "1-й уровень:говорим по-простому, но плюс-минус грамматически правильно. Например, не зная выражения «прикрой форточку», говорим проще: «закрой маленькое окно, но не до конца».",
      "2-й уровень:говорим на конкретные темы именно теми фразами, которые используют носители языка («прикрой форточку»).",
      "Есть реальная история про русского математика, который читал лекцию на английском в Оксфорде. Упоминал степени, корни, дроби и прочие математические штуки, которые не каждый переводчик сумеет правильно описать без подготовки. А после лекции к нему подошла студентка и попыталась заговорить. Математик улыбнулся: «Sorry, I don’t speak English». Лекцию он прочитал настоящими фразами носителей, но за пределами описания математических формул и действий едва говорил на 1-м уровне.",
      "3-йуровень:почти в любой ситуации говорим фразами носителей.",
      "На 1-й уровень можно выйти за несколько месяцев с нуля.",
      "В вузе вторым языком у меня был французский. Преподавали его так себе: то, что изучали 4 года, сильный репетитор дал бы за пару месяцев, разговорной практики не было совсем. А сразу после окончания я оказался во Франции.",
      "Приземляюсь в Марселе, по-французски не могу связать двух слов, в зубах разговорник. Но я не обычный турист: фразы в разговорнике для меня не случайный набор звуков — я понимаю, по каким законам эти фразы построены. Могу из утвердительного предложения сделать отрицательное, а из настоящего времени — прошедшее или будущее.",
      "Через 3 дняя уже поддерживал простые бытовые разговоры. Заодно довёл до автоматизма пару десятков настоящих носительских фраз из разговорника, потому что они были нужны несколько раз в день: как доехать, сколько стоит, как это называется, кем работаете.",
      "Через две неделия обсуждал общественно-политические темы. Я пока не мог сказать «падение стандартов высшего образования вызывает нарастающее беспокойство среди интеллигенции». Говорил проще: «умные люди думают, что образование в университетах стало плохое».",
      "Красивости — дело наживное. Главное на этом этапе — довести до автоматизма принципы построения фразы.",
      "Через 7 недельфранцузы, знавшие меня всё это время, не верили ушам: я строил навороченные предложения, и порой даже без ошибок! Сам поразился, как быстро заговорил на языке, который, как мне самому (!) казалось, я совсем не знал.",
      "Похоже, до приезда во Францию у меня былонечто более важное, чем умение говорить:я знал пусть не все, но основные принципы построения предложений. Без этого ни 7 недель, ни даже год во Франции не дали бы такого результата. И да, каждый день до обеда я делал на пляже упражнения по переводу с русского на французский. И да, постоянно смотрел в словарь.",
      "Я не сделал ничего сверхъестественного. Если знать, как работает язык, любой заговорит на 1-м уровне за пару месяцев.  С преподавателем — даже быстрее.",
      "2-й уровень развития речи: Ищем и стараемся использовать точные естественные фразы, которыми говорят сами носители(прикрой форточку). Ты всё реже звучишь как гастарбайтер + риск недопонимания намного меньше. «Сесть на автобус» по-английски не «sit on the bus» — для этого есть конкретное устойчивое выражение.",
      "Такие устойчивые выражения есть почти для каждой жизненной ситуации. Их миллион, даже профессионалы знают далеко не все. Мужчина-переводчик вряд ли скажет как будет правильно «вдеть нитку в иголку». Зато эту фразу может знать девочка с уровнем Elementary, которая любит шить.",
      "Да-да, крутые переводчики в хороших костюмах часто не знают (или не успевают вспомнить) конкретную устойчивую фразу, и тогдаскатываются на 1-й уровень— передают нужную мысль так, чтобы их просто поняли.",
      "Профессионалы коллекционируют эти фразы десятилетиями. А чтобы удерживать это всё в голове, даже в языковой среде нужны сознательные усилия — просто «жить» там недостаточно. Кстати. Многие британские фразы в США звучат странно. И наоборот.",
      "Говорение — это реакции, способность мгновенно построить (или вспомнить) фразу.  Реакции эти нужно нарабатывать и поддерживать, как спортивную форму.",
      "Прожив полгода в США я на русские вопросы машинально отвечал на английском. Через два дня после возвращения это прошло. А через два месяца уже приходилось задумываться, как выразить мысль. Я не стал хуже знать язык — просто ослабла реакция.",
      "Марафонцы-профессионалы тренируются до трёх раз в день, набегая по 150 км в неделю. Если растянуть эти 150 км на месяц, результата НЕ БУДЕТ, хотя вроде бы те же 150 км.",
      "Так же и с разговорной реакцией. Для грамматической базы 2-3 занятия в неделю ок. А вот чтобызаговорить, работать придётся чаще.",
      "Иначе что получится? На разговорном занятии вы наработали едва заметные, зыбкие реакции. День перерыва — эти реакции ушли. Вы их нарабатываете заново на следующем занятии. Потом 3 дня перерыва — половины этих реакций уже нет. Поэтому разговорный клуб раз в неделю — баловство. Хотя и лучше, чем ничего.",
      "Слова и фразы, которые мы знаем, делятся наактивныеипассивные.Активныеотработаны до полного автоматизма (do you speak English вы вспомните в любой момент).Пассивныеслова и фразы мы узнаём в чужой речи, понимаем, но сами вспомнить в нужный момент не можем. Чтобы они стали активными, их нужно использовать несколько раз в реальной или игровой ситуации общения.",
      "Сотни заимствованных слов мы запоминаем без усилия: кринж, спойлер, дисконт. А если учить их специально именно как английские, идёт почему-то туго.Слова легче запоминаются, если они ложатся в готовую операционную систему языка.Сначала учим сам язык, а уже потом слова и говорение. Не перепутайте.",
      "Говорение развивается в три этапа:",
      "1-й этап.Разбираемся, как связываются слова в языке. Это самый сложный и ответственный этап, когдапреподаватель действительно необходим. В английском эта задача решается за 3-4 месяца. Я, кстати, намеренно не говорю «грамматика». Учебники рассказывают, КАК строить фразу, и называют это грамматикой. Но почти никогда не разбирают, ПОЧЕМУ ИМЕННО ТАК. Без понимания ПОЧЕМУ ТАК путаешься при построении даже самых простых фраз.",
      "В языковой среде 2-й и 3-й этапы не нужны, но вот этот 1-й не получится обойти даже там: без него язык встанет криво, примеров среди эмигрантов — миллионы.",
      "2-й этап.Спокойно, вдумчиво делаем упражнения по переводу с русского на иностранный.",
      "Многие пытаются говорить, минуя этаппереводных упражнений.Это как учиться ездить на велосипеде, сразу не держась руками за руль. Научишься, конечно, в конце концов. Но лучше научиться сначала просто держать равновесие, контролируя руль руками, а уже потом пробовать отпускать.",
      "Если замахиваетесь на 2-й уровень говорения, надо решить, какие конкретно темы интересуют и выбрать учебный материал.",
      "Есть серии учебников для самостоятельной работы с самыми актуальными темами. В этих учебниках любой разворот посвящён конкретной теме, например, «Студенческая жизнь». На странице слева приведены устойчивые фразы в форме связного текста, справа — упражнения для закрепления этих фраз, в конце пособия — правильные ответы. В другом похожем учебнике темы будут примерно те же, но он будет целиком посвящён, например, фразовым глаголам. Есть озвученные носителями диалоги с расшифровками на каждую из актуальных тем. Разговорники — полезнейшая вещь: фразы в них самые ходовые и тоже структурированы по темам.",
      "Не переживайте, что пока этот материал в пассиве — чем ответственнее отработаем 2-й этап, тем быстрее выведем всё в актив на 3-м.",
      "3-й этап.Незадолго до того, как придётся говорить в реальной жизни, начинаем отработку разговорных реакций.",
      "Главный принцип — говорить много и говорить часто. Перерывы, даже в 1-2 дня, губительны.Если процесс начат, останавливать его нельзя.Хорошо подумайте: есть ли у вас достаточно свободных часов, точно ли нужно вот прямо сейчас учиться говорить? Слишком быстро отмирают реакции, слишком быстро отработанные фразы уходят в пассив.",
      "С другой стороны, если когда-то бегло разговаривали, восстановить навык проще, чем нарабатывать его в первый раз — это работает так же, как мышечная память.",
      "Есть два принципиально разных способа развития устной речи:фундаментальныйифункциональный.",
      "Фундаментальныйподробно описан в этой статье. Он даёт стабильные долговременные навыки.",
      "Функциональныйприменяется в некоторых обучающих системах для того, чтобы максимально быстро человека «разговорить». Студенты заучивают наизусть правильные носительские фразы без понимания их грамматического устройства и «говорить» начинают с первого занятия. Отрабатывают эти фразы до полного автоматизма. У любого человека так отработаны do you speak English, made in China и London is the capital of GB. Когда накапливается критическая масса таких фраз, на их основе уже можно интуитивно создавать свои собственные. Да, половина предложений звучат примерно как «моя спортзал ходить», но если надо просто очень быстро научиться доносить мысли, то способ вполне рабочий. Минусы: 1) соотношение затраченного времени и выхлопа не очень хорошее; 2) после прекращения занятий навыки стремительно отмирают, потому что взрослый человек не способен надолго запоминать то, чего не понимает.",
      "Речь любого человека состоит из фраз, которые он:",
      "создаёт прямо в процессе разговора;",
      "знает наизусть (не важно, понимает он их внутреннюю логику или нет) – они вылетают автоматически, без мыслительного усилия (do you speak English).",
      "И это АБСОЛЮТНО РАЗНЫЕ способы говорения. Даже по-русски на привычные темы мы говорим как из пулемёта, но порой проходим через агонию, пытаясь выразить сложную мысль (это при том, что о грамматике даже не думаем).",
      "В беглой речи мы не формулируем каждую мысль с нуля, а опираемся на усвоенные до автоматизма шаблоны (would you like to/some ..?) Авторы некоторых систем предлагают: если мы всё равно говорим шаблонами – так давайте сразу и учить эти шаблоны! Зачем нам громоздкий посредник в виде грамматики??",
      "Речевые шаблоны В РАЗЫ быстрее доводятся до полного автоматизма, если понимаешь их внутреннюю логику.",
      "Здесь в постскриптуменебольшое (но важное!) дополнение к этой статье."
    ]
  }
}