{
  "title": "DevRel Conf #9: обзор программы",
  "views": "151",
  "link": "https://habr.com/ru/companies/oleg-bunin/articles/934382/",
  "text": {
    "article_content": [
      "Эта статья — краткий гид по программе грядущей конференции. Прием докладов окончен, кровавые битвы за слоты в сетке завершены, программа собрана иопубликована. За дверями чата Программного комитета осталось больше ста часов обсуждений и созвонов с потенциальными спикерами, результаты которых мы покажем24 сентябряна конференции в Москве.",
      "Ниже расскажем, как подходили к формированию программы и какие тематические блоки можно выделить, чтобы определить те доклады, которые принесут вам наибольшую пользу.",
      "Расти большой: стратегия",
      "Стенды, Хабр, два мерча: инструменты",
      "Сначала было слово: продуктовый devrel",
      "Я тебя породил? Сообщества",
      "Вишенки на торте",
      "Заключение",
      "Доклады по 30 минут сложно пересказать в паре предложений, а часть тем не получила своего хайлайта в статье, поэтому дополнительным источником деталей послужит аннотация от Программного комитета. Она скоро появится на странице каждого доклада, чтобы вам было легче сопоставить программу с вашими персональными потребностями.",
      "Мы в программном комитете конференции будем рады ответить на любые вопросы о программе в комментариях - подскажем с деталями и инсайдами из докладов, порекомендуем, что послушать под ваш конкретный запрос.",
      "Прошло уже достаточно времени, чтобы функция devrel прожила весь цикл развития от точечного инициативного движения без названия кважной и значимой составляющей общей стратегии бигтеха. Для грядущей конференции мы пригласили спикеров, которые дадут полный обзор этой эволюции и подчеркнут важные вехи, свойственные каждому этапу развития компании и devrel-функции в ней.",
      "Что делать, когда твоя задача на испытательном сроке (или еще до собеседования) – написать стратегию, а ты еще мал.Алексей Корнеев, \"С самого начала у меня была стратегия и я ее придерживался\": пишем и защищаем план действий",
      "Разобравшись с вопросомсмысла жизнипоявления devrel в компании, осваиваем ключевые шаги - строим EVP, который отражает суть компании и действительно проводит раздел “я - другие”.Анна Мартынова,  Бренд работодателя как он есть",
      "Поняв, «что» и «зачем» мы планируем делать, переходим к «как». Но это уже тактика, а в вопросе стратегии важно учесть и своих коллег из других направлений. На примере HR-функции обсудим, как построить совместный план и не сломать друг другу процессы.Юлия Полякова, «Переводчик с деврельского на рекрутерский и обратно – без смс и регистраций»/«Рекрутер vs DevRel: как выстроить win-win-взаимодействие»",
      "Болезни роста не щадят никого. Подглядываем у коллег «постарше» и обсуждаем, что ждет нас на каждом этапе развития и взросления.Дарья Пешая, От личных связей к системам — эволюция DevRel-процессов по мере роста компании",
      "В чем сила, брат? В том, что «если профессия формируется — ты можешь ее формировать» (с). Мотивирующий доклад-размышление о перспективах профессии devrel специалиста и горизонтах его карьерного пути.Иван Лукьянов, Chief DevRel Officer, миф или вымысел",
      "Тема инструментария devrel-специалиста наиболее широко представлена в программе — и неспроста. Мы разобрались со стратегией, смирились с ее изменчивостью и плавающим горизонтом планирования, и теперь наконец переходим к реализации.",
      "Выбирая инструменты, мы часто начинаем с подручных, затем переходим к массовым, а следом к эксклюзивным. Хорошее понимание базовых методов работы позволяет не только открывать новый инструментарий, но и эксплуатировать старый-знакомый в новых форматах. В программе мы собрали доклады обо всех категориях:",
      "Основы работы на стендахЮлия Кульмухаметова, «Коммуникация на стенде: как создать интересные активности под запросы стейкхолдеров и ЦА»;",
      "Эффективное присутствие на ХабреВадим Рощин, Метрики блога на Хабре: что измерять и как доказать бизнесу, что это важно",
      "Трансляция трансформирующегося бренда на аудиторию, которая знает вас совсем другимиРоман Жуков, Грести или не грести? Как поменять отношение к HR-бренду через активности на стенде",
      "Мерч как мультизадачный инструмент с длинным циклом планированияАлеся Кузьминова, Мерч как канал коммуникации с IT-аудиторией: цикл от планирования до оценки",
      "Сверка по соцсетям - без перегибов, с сохранением тематики и без высосанных пальцевАлена Лебедева, Соцсети для технобренда: как транслировать свою уникальность в контенте и найти баланс между анонсами, «каруселями» и мемами",
      "Блогеры-инженеры и когда их все-таки нужно мотивироватьАлина Боровицкая, Первое правило блогерского клуба: никто не требует вашего участия",
      "AI в задачах devrel-специалистаМихаил Попов, DevRel AI: Хайп или для чего нейросети деврелу?",
      "Расширение поля деятельности на новые слои аудитории — студентов и школьниковМихаил Череповский, Деврелы скоро вымрут: как сильный молодежный бренд может убить профессию",
      "Исследования под любую задачу devrel функцииНаталья Акберова, «Я только спросить»: зачем в DevRel исследования ЦА и как их использовать на практике",
      "Сначала было слово, и слово было “не то вы называете деврелом”. Кому не знаком этот холивар — можно позавидовать. Или посочувствовать)) Первоисточник, заимствованный нами из западных практик, возник на стыке функций IT и продаж (технологичного продукта). Хотя цели и ЦА схожи, объект отличался кардинально - первоисточник “продавал” разработчикам продукт для прямого пользования, а деврел в нашей версии - чаще всего “продает” бренд своей компании. Что ж, этот час настал - мы поворачиваемся в сторону продукта.",
      "Мы видим по инфополю и офлайновым выставкам на конференциях, что все больше компаний презентуют себя через производимый продукт. И хотя идея не нова и механики похожи, продуктовый деврел представляет собой поле со множеством невспаханных вопросов.",
      "На конференции мы обсудим базовую базу продуктового деврела на опыте dev-адвокатов, буквально стоявших у истоков этого ремесла.Александр Белоцерковский, Подключаем DevRel к продукту",
      "Детальнее проанализируем разности и схожести между брендовым и продуктовым деврел-процессом.Татьяна Казакова, Мария Юнева, Как почувствовать себя продуктовым DevRel’ом (и зачем это вам)",
      "Убедимся на примере коллег, что developer relations могут возникнуть в самых неожиданных точках и нанести самую непредвиденную пользу.Сергей Востриков, Как мы строим DevRel через API, документацию и open source-инструменты",
      "И подслушаем полезное в разговоре о сообществах. Например, community-driven development и сообщество для продуктового фидбека, о как!Илья Пономарев, Одна стратегия, чтобы править всеми",
      "Работа с сообществами для devrel-функции всегда была одним из ключевых бустов, а сейчаспереживает трансформацию «внутрь»— от внешних мы переходим к выращиванию внутренних сообществ, и часто делаем это рука об руку с HR-департаментом (либо под их пристальным взглядом из-за угла).",
      "Создаем, развиваем, деликатно замеряем и не душим гиперопекойМарина Мелкова, Метолодогия создания экосистемы сообществ и их развитие",
      "Но и внешние сообщества рано списывать со счетов. Наоборот, вместе с трансформацией объекта технопиара (бренд -> продукт бренда) сообщества становятся важным участником в жизни продуктового devrel’а. Сообщество – ваш буст разработки, фрейм для продукта и саппорт для пользователейИлья Пономарев, Одна стратегия, чтобы править всеми",
      "Devrel-функция растет и трансформируется в задачах и в способах их решения. Подборка любопытных докладов, из которых узнаем, как:",
      "Купить конфу и не угробить -Светлана Павлова.",
      "Создать собственный Программный комитет, с экспертами и мотивацией -Анна Королева.",
      "Придумать название к докладу, которое будут пересказывать в кулуарах -мастер-класс Алексея Мерсона.",
      "Выйти из конфликта сухим и с единомышленниками -Наталия Макарова и Андрей Кёниг.",
      "Стать продактом самому себе и вывезти все, что напихал в бэклог -Анастасия Маслова.",
      "Наблюдать за развитием сообщества и целой индустрией, вырастающей из него, очень увлекательно. Впредыдущем материалеПрограммный комитет вспоминал самые любимые доклады прошлых конференций, теперь мы с нетерпением ждем встречи в сентябре, чтобы обсудить, как меняется devrel-функция в России и куда она может нас привести в скором будущем.",
      "А что вам хочется услышать из программы DevRel Conf?Давайте обсуждать ваши впечатления – здесь в комментариях и очно наDevRel Conf #9."
    ]
  }
}