{
  "title": "IT Волчата: как кандидаты с фейковым опытом взламывают найм и что с этим делать?",
  "views": "2.3K",
  "link": "https://habr.com/ru/companies/rgs_it/articles/934488/",
  "text": {
    "article_content": [
      "Привет, Хабр! Меня зовут Иван, я руководитель отдела тестирования фронт офисных и интеграционных систем в РГС. IT‑рынок последних лет наводнили «волчата» — кандидаты, которые не просто приукрашивают, а «накручивают» свой опыт, выдавая себя за более опытных специалистов. Учат их этому менторы в Telegram‑сообществах, где делятся готовыми шаблонами резюме и скриптами для собеседований. Почему явление стало массовым, как оно бьет по бизнесу, профессиональному сообществу и как защищаться — разбираем в статье.",
      "На одном из очередных собеседований меня посетила мысль: «Почему у всех кандидатов такие одинаковоразвернутые ответы, которые они выдают со скоростью пулеметной очереди? Почему все употребляют одни и те же фразы: “простите, я волнуюсь”, “сейчас вспомню”? Почему рассказывают заученные истории про проекты, которые звучат подозрительно одинаково? Почему, в конце концов, у всех шаблонные резюме? Что‑то тут не так…».",
      "Я поделился с коллегами этими мыслями, и так начался наш OSINT‑эксперимент: мы стали сравнивать резюме, проверять информацию о кандидатах в открытых источниках, подключили ИИ для анализа, внедрили запросы на подтверждение опыта, дополнительно запустили перформанс‑ревью после онбординга, чтобы отделить реальный опыт от выдуманного.",
      "Шаблонное резюме:оно не всегда идеально оформлено, но имеет шаблонную структуру и определенные паттерны.",
      "Например, ИП или фриланс — красный флаг для рекрутеров, поэтому по методологии «волчат» лучше вместо них указать какую-нибудь компанию (все равно же никто не проверит или не обратит внимания). Опыт только от полутора лет, так как до этого конверсия положительных откликов достаточно низкая. Если опыт разделен на несколько компаний по несколько месяцев — нужно объединять его в одну запись, чтобы не выглядеть «летуном». Эту рубрику «вредные советы, которые работают» можно долго продолжать.Конечно, не исключено, что такие приемы используют не только «волчата» и было бы неправильно «грести всех под одну гребенку», поэтому важно смотреть на совокупность факторов.",
      "Опыт:накрутка как правило от трех лет, если говорить о позиции мидла (21 год → 3 года 4 месяца стажа). Учебные проекты подаются как коммерческие, работают уже с 18 лет.",
      "Технологии:перечислено все самое модное, что должно попасть в фильтр HR: Postman, Swagger, TestIT, Jira, Confluence, Kafka, Jenkins, Kibana, Kubernetes, DBeaver, DevTools, Figma, Android Studio, Browserstack, Charles Proxy.",
      "Поведение на собеседовании:заученные развернутые ответы, демонстрация полного согласия с интервьюером, поддакивание без уточняющих вопросов, а после оффера у «волчонка» есть острая необходимость поторговаться за небольшую прибавку (не столь ради денег, сколько ради принципа).",
      "Мотивация:войти в IT «любой ценой», работать меньше получать больше.",
      "Увы, от таких кейсов никто не застрахован, особенно в пылу дедлайнов и большого количества задач. У нас лично было порядка 7 подобных кандидатов, опишу двоих:",
      "Кандидат А.QA‑инженер, 3 года 4 месяца опыта и внушительный стек: Kafka, Kubernetes, Jenkins, Swagger, TestIT и т.д.. В CV было всё то, что нужно для крепкого мидла, его-то мы и искали. Возраст 24 года и профильное образование в области юриспруденции нас не особо смутили, так как в жизни всякое бывает.",
      "На интервью кандидат держался молодцом: уверенно говорил про стек, инструменты, приводил правильные примеры из тестирования API и мобилок. Учитывая авральный режим повседневной рутины, мы задали стандартный набор вопросов, ни один не вызвал подозрений, кандидат знал, что сказать (отдаем должное, его неплохо натаскали), где-то отвечал с задержками, но мы сделали скидку на волнение. Вдобавок ко всему обратная связь по прескринингу от HR была положительной, так что мы приняли решение взять его в команду и после оформления передали на онбординг.",
      "Первые сомнения появились через пару недель работы:",
      "При выполнении реальных задач кандидат задавал вопросы о базовых вещах уровня джуна;",
      "Не смог разобраться с коллекцией Postman, а когда «разобрался» и пришел показывать сделанную работу, стало понятно, что он прогнал образец через Chat Gpt;",
      "Все заявленные знания о DevTools, Postman, Swagger куда-то внезапно исчезли. Новоиспеченный сотрудник ссылался на то, что забыл, волнуется, давно не пользовался.",
      "После этого мы предприняли ряд мероприятий:",
      "1.Запрос СТДР (справки о трудовой деятельности)",
      "Официально запросили документ, подтверждающий трудовой стаж. Выяснилось, что опыт, указанный в резюме, просто отсутствует",
      "2.Проверка резюме через ChatGPT",
      "Прогнали текст резюме через GPT, обученный на выявление «волчачьих» признаков, модель подтвердила риск",
      "3.OSINT‑проверка (открытые источники)",
      "Нашли в соцсетях публичные следы знакомства и взаимодействия новичка с одним из менторов, который на своем сайте предлагает «гарантию трудоустройства в IT» и не скрывает расценок. Это, конечно, косвенное доказательство, но в совокупности с другими установленными фактами переводит подозрение в разряд утверждений.",
      "4.Перформанс‑ревью после онбординга",
      "На испытательном сроке провели детальное ревью: проверили выполнение реальных задач, вовлеченность в процессы, способность к самостоятельному тестированию. После этого этапа несоответствие заявленного и реального профессионального уровня подтвердилось окончательно",
      "Итог, само собой, — увольнение.",
      "Кандидат Б.Резюме выглядело отлично: почти 4 года опыта, уверенное владение Kafka, Postman, GitLab, автотестами на Java, развернутые ответы. Но несколько раз посыпался на простых вопросах, в стиле: «что означает буква “S” в https?», хотя ранее был развернутый, хрестоматийный ответ про протокол передачи данных.",
      "Наученные горьким опытом, мы проверили первую же фирму в резюме, она оказалась зарегистрирована в Беларуси. Нашли эйчара этой компании, связались с ним, и тот ответил, что найм нашего кандидата у них был в принципе невозможен по определенным причинам. Затем запросили СТДР и увидели, что реальный опыт —3 месяца и тот по совместительству. На этот раз мы уже были научены опытом, по итогу кандидату отказали и сделали вывод: без системных проверок «волчата» легко проходят собеседование.",
      "А что же стало с пятью остальными волчатами? Троим отказали в последний момент: несостыковки всплыли уже после технического собеседования, остальные двое путаясь в вопросах про ГПХ и в деталях своих же проектов, поэтому отсеялись на этапе интервью. Вероятно, они шли «паровозиком», заметив, что компания активно нанимает специалистов.",
      "Мы обязаны признаться себе в том, что «волчата» — это не отклонение, а естественный результат среды, где приукрашивание выгоднее честности. «Волчата» не появились сами по себе — это следствие антипаттернов найма и специфики ИТ, в которой HR-фильтр лишь усиливает проблему.",
      "Давайте разберемся, каким образом мы привлекаем именно тех, кто научился играть по правилам фильтра, а не тех, кто готов учиться и работать:",
      "Скорость выше качества: приоритет скорости закрытия вакансий над оценкой реальных навыков. Проверяют не глубину, а ключевые слова в резюме. Проходят те, кто красиво упаковал себя, а не те, кто реально что-то умеет и чего-то стоит;",
      "Фетишизация стажа: компании гонятся за цифрами «3 года опыта» вместо того чтобы проверять реальные навыки. Тех, кто пишет честно, отбрасывает фильтр, а «волчата» приукрашивают резюме и попадают в выборку;",
      "Курсы‑конвейеры: рынок обучения продавал мечту «мидл за 3 месяца», а не готовил ребят к реальной работе. Как следствие, трудоустройство осложнилось, потому что такие специалисты стали не нужны, все хотели Senior с 100+ лет опыта, и тут на сцену вышли менторы, которые «натаскивают» на прохождение собеседований. Цена примерно одинаковая, следовательно, какой смысл отдавать деньги за курсы, если ты можешь отдать деньги за «гарантию трудоустройства»?",
      "Отсутствие системных проверок: ни на этапе резюме, ни на этапе испытательного срока нет инструментов, чтобы быстро и честно выявлять разрывы.",
      "Что, как мне кажется, можно сделать, чтобы перестроить существующий найм на этапах HR, СБ и Технического интервью:",
      "1.      HR.Переход от формального прескрининга к анализу опыта кандидата:",
      "Не ограничиваемся стажем и стеком, проверяем логику опыта кандидата: даты, роли, соответствие технологий заявленному уровню;",
      "Используем OSINT и AI для быстрого выявления шаблонных резюме и несостыковок;",
      "Передаем на техническое собеседование не просто вывод «подходит/не подходит», а контекст: возможные риски и на что стоит обратить внимание.",
      "2.Служба безопасности.Проверка фактов, а не только формальных документов и рекомендаций:",
      "Подтверждаем опыт через СТДР и открытые источники;",
      "Сопоставляем профили кандидатов: соцсети, Telegram, резюме с разных площадок;",
      "Подключаемся на ранних этапах для выявления несоответствия между заявленным и фактическим опытом.",
      "3.Команда QA.Меняем подход к собеседованиям и онбордингу:",
      "Выделяем время на тщательную подготовку к интервью и изучение резюме кандидата;",
      "Проверяем не «Есть ли у тебя опыт работы с Postman?», а «Как ты хранишь и передаешь данные между запросами в цепочке вызовов?»;",
      "Даем мини‑кейсы: практические задачи на 5–10 минут, чтобы проверить, как рассуждает кандидат;",
      "Включили быстрый перформанс‑ревью на испытательном сроке через 2–4 недели, даем ОС по модели STAR/AR.",
      "В результате ожидаем, что ошибки найма заметно снизятся, а доверие между HR и командой наоборот возрастет.",
      "Если коротко, то да. И чтобы сохранить качество продукта и здоровую атмосферу в командах, нужно перестать полагаться на автофильтры и стандартные консервативные подходы. Необходимо выстраивать четкую процедуру скрининга кандидатов и объективную систему оценки в контексте новой реальности.",
      "Решение не в «охоте на ведьм», а в перестройке процесса: прозрачные грейды, ситуационные проверки, совместная работа HR и руководителей отделов/управлений/департаментов, перформанс‑ревью и культура менторства внутри компании. И, пожалуй, один из самых важных тезисов этой статьи:не бояться обучать!",
      "Многие компании боятся вкладывать ресурсы в обучение: «Мы сейчас его научим, а он уйдет!» или «Лучше взять готового, который придет и сразу будет делать!». Но во всем должен быть баланс. Практика показывает, если с первого дня сотрудник понимает, какую ценность он представляет для команды/проекта/ компании, и что у него есть прозрачная система роста (грейды, наставничество, ревью), он не бежит при первой же возможности, а остается ради собственного развития, карьеры, признания и сплоченной команды. Вкладываясь в подготовку кадров, компания экономит на исправлении ошибок и снижает текучку.",
      "Настоящий риск не в том, что человек уйдет после обучения, а в том, что останется и регулярно будет добавлять ложку дегтя в бочку ценности, производимой командой.",
      "А каким образом мы перестраиваем процессы внутри нашей большой и дружной компании (совместная работа с HR, культура менторства, модели развития) подробно хочу рассказать в следующих статьях."
    ]
  }
}